{
    "NoticeData": [
        {
            "Header":"[Patch Note] v200130",
            "Date":"19.12.2023",
            "Contents":"<b>イベントダンジョンオープン</b>\n\n- 2023年12月20日から2024年1月9日まで、豪華なリワードが得られるイベントダンジョンがオープンします！リワードはゴールデンダスト、シルバーダスト、APポーション、砂時計などがあり、プレイするたびに10以上の経験値を獲得することもできます。\n\n<b>クリスタルルンスロット追加</b>\n\n- ステータスルーンとスキルルーンスロットをそれぞれクリスタル5Mと50Mで一つずつ開くことができます。\n\n<b>新DCCペット機能追加</b>\n\n- 製作にソウルストーンを使用するペット機能が追加されました。 現在はPC版でソウルストーンを獲得することができ、近日中にモバイル版でも使用できるようにする予定です。\n\n<b>バグ修正</b>\n\n- アリーナまたはステージで着用した装備が解除されるバグを修正しました。"
        },
        {
            "Header":"[Patch Note] v200120",
            "Date":"13.12.2023",
            "Contents":"<b>ルーン召喚機能追加</b> \n- 工房の召喚メニューからルーンストーンを召喚することができます。 \n- このメニューでは、ワールドボスルーンストーンと今回のルーン召喚でしか獲得できない新しいルーンストーンを召喚することができます。 \n- ルーン召喚には20個のゴールデンダストが使用され、1回召喚するごとに10個のルーンストーンを獲得することができます。 \n- 11回召喚はオーラ召喚と同じく200個のゴールデンダストが使用されます。\n\n<b>8種類の新規ルーン</b> \n- 工房の召喚メニューから製作及び強化可能な8種類のルーンが追加されました。 \n- 今回のアップデートを皮切りに、より戦略的に活用可能な様々なスキルとステータスをルーンで提供する予定です。 詳細はミディアムでご確認できます。\n\n<b>クリスマス記念メインロビーの改装</b> \n- 年末を迎え、メインロビーにクリスマス装飾を追加しました。 \n- このような装飾だけでなく、様々なイベントをご用意しておりますので、年末感溢れるNine Chronicles Mをお楽しみください。"
        },
        {
            "Header":"[Patch Note] v200110",
            "Date":"22.11.2023",
            "Contents":"<b>Nine Chronicles Mがオープンしました！</b>\nGoogle PlayやApp Storeなど、さまざまな国でNine Chroniclesモバイルバージョンを楽しむことができます。\n\n<b>Multiplanetary：新しいネットワークシステム</b>\n既存のNine Chroniclesメインネットでは処理できるトランザクションの総量が制限されていました。また、過去数年間にわたるプレイの記録が既に蓄積されており、新しいシステムで競争することが難しいという問題もありました。これらの問題を克服するために、2つ以上のネットワークをサポートするMultiplanetaryを導入しています。\n\n- 既存のメインネットのプレイ記録はその後Odinと名付けられ、従来通りプレイできます。\n- Multiplanetaryシステムの導入とともに、新しいネットワーク- Heimdallがローンチされます。\n- 各ネットワークはPlanetと呼ばれ、独自のプレイ記録と経済システムを持っています。\n詳細は以下のリンクを参照してください。\n[https://bit.ly/9C_M_New_Chain_Heimdall](https://bit.ly/9C_M_New_Chain_Heimdall)\n\n<b>バランス調整</b>\n初期のユーザーがさまざまな装備クラフトと冒険の経験を楽しむために、さまざまな値が変更されます。\n初期の強化コストは削減され、装備のクラフト時の初回の経験値、ワールドごとのクリアボーナスなどが従来よりも向上しています。\n\n新しいAuraのリリース\nGolden Dustで召喚可能なイージスオーラ（アリーナスペシャル）と弾幕オーラ（アドベンチャースペシャル）が追加されました。\n詳細は召喚メニューを確認してください。\n\n<b>シーズンパスシステムの追加</b>\nゲームをプレイするだけで蓄積される勇気経験値で多様な補償が受けられるシーズンパスシステムが追加されました。"
        }
    ]
}
