{
    "NoticeData": [
        {
            "Header": "v200320",
            "Date": "24.4.2025",
            "Contents": "<b>Synthesis Balance Adjustment</b>\n\n- We have tweaked the required material amounts and success rates in the Synthesis system so that you can now reliably obtain higher-grade items. Mythic-grade items are also obtainable via synthesis\n- <b>New Grimoires Added</b>\n    - 9 Mythical-grade grimoires\n        - You can obtain them through the Summoning and Synthesis systems\n- <b>New Costumes Added</b>\n    - 1 Mythical-grade costume\n        - You can obtain them through the Summoning and Synthesis systems.\n- <b>Worldboss Balance Adjustment</b>\n    - The World Boss has been strengthened to match the players’ boosted stats following the release of new equipment.\n- A maximum cap has now been applied to stat reduction skills\n    - ATK Reduction(Aegis Aura) - Max 85%\n    - SPD Decrease (Fenrir SPD Down Rune) - Max 20%\n    - The skill cap is applied to each individual skill ID up to its maximum value, and then the results are added together."
        },
        {
            "Header": "v200310",
            "Date": "24.4.2025",
            "Contents": "<b>World 9 Update – Part 1</b>\n- Stages 401–430 of World 9: Vanaheim have been added.\n    - You can obtain crafting recipes for <b>Normal Mythical-grade equipment</b> from stages 401–405.\n    - Recipes for <b>Fire and Water  Mythical-grade equipment</b> can be obtained from stages 415–427.\n    - The crafting system for Mythical-grade equipment now includes the following characteristics:\n        - <b>Golden Dust</b> is required as a material for crafting.\n        - Some materials cannot be substituted with crystals and must be obtained directly through stages.\n    - The <b>Normal Mythical equipment</b> has a lower level requirement of <b>350</b>, to help existing players transition into World 9 more smoothly.\n- The remaining stages of World 9 and the final set of equipment will be released in the next update.\n- Stage dialogues that reveal the story of World 9 will also be available in the next update.\n\n<b>4 New Mythical-grade Auras Added</b>\n- The following four Mythical-grade auras have been added to aura summons: <b>YMIR, BEAST, AEGIS, and BARRAGE</b>.\n    - Summon rates have been adjusted with the addition of these Mythical-grade auras.\n\n<b>1 New Mythical-grade Costume & 2 New Sacred-grade Costumes</b>\n- The <b>Mythical-grade \"Sea Ran\" costume</b> and <b>2 Sacred-grade costumes</b> have been added to costume summons.\n    - Summon rates have been adjusted with the addition of the Mythical-grade costume.\n    - Sacred-grade costumes have received stat buffs following the introduction of the new Mythical grade.\n\n<b>Rune Enhancement Cost Adjustment</b>\n- To reduce the burden of enhancing certain runes, frequent NCG requirements have been compressed into 50-level intervals, and the required number of rune shards has been increased.\n    - The following runes are included in this adjustment:\n        - <b>Golden Leaf Rune, Fenrir HP Rune, Fenrir ATK Rune, Fenrir Bleeding Rune, Saehrimnir HIT Rune, Saehrimnir DEF Rune, Saehrimnir Skill Rune, Stun Rune (Adventure), Stun Rune (Arena), Vampiric Rune (Adventure), Vampiric Rune (World Boss), Stamina Rune (Adventure), Stamina Rune (Arena), Quick Rune (Arena), Quick Rune (World Boss)</b>\n\n<b>Skill Balance Changes</b>\n- The max damage of the <b>Thorns skill</b> attached to some <b>Legend armor</b> and world <b>boss runes</b> has been adjusted.\n    - The damage dealt by these items and runes is now capped at <b>200,000 per hit</b>.\n\n<b>Leaderboard Feature Resumed</b>\n- The leaderboard feature has been resumed for two categories in the client: <b>Ability</b> and <b>World</b>."
        },
        {
            "Header": "v200290",
            "Date": "11.3.2025",
            "Contents":"<b>World Boss Improvements</b>\n\n- <b>Changes to Season Reward Distribution</b>\n    - The reward distribution method will change from a ranking-based system to a system where the total reward pool is distributed based on players' contributions.\n- <b>Improved Reward Distribution System</b>\n    - Instead of distributing rewards in bulk after the season ends, players will now be able to <b>claim</b> their rewards individually.\n        - <b>Claim Period:</b> Rewards can be claimed during the two-week off-season after the season ends.\n        - <b>Claim Location:</b> The rewards can be found in the same location as the previous season rewards.\n            - During the season, the total reward pool and the player's contribution will be displayed.\n            - During the off-season, the reward amount claimable based on the player's contribution will be displayed.\n- <b>Fixed Ticket Purchase Price</b>\n    - Due to the change in the reward system from ranking-based to contribution-based, the ticket purchase price will be fixed at <b>1 NCG</b> (The same price applies up to the maximum purchase limit).\n- <b>World Boss HP Adjustment</b>\n    - HP of all <b>Wave World Bosses</b> will be increased.\n    - The <b>Global HP</b> of the World Boss will be increased.\n\n<b>Arena Improvements</b>\n\n- <b>Tickets:</b>\n    - The default ticket purchase amount will be changed from <b>4</b> to <b>1</b>.\n    - When purchasing tickets, the total number of tickets purchased for the season will be displayed.\n- <b>Opponent List:</b>\n    - If there are more than 1,000 participants, the opponent list will be adjusted to target those ranked below <b>1,000</b>.\n\n<b>Game Improvements</b>\n\n- Added an <b>automatic material registration feature</b> for grinding.\n- To improve game execution speed, the leaderboard ranking display and <b>custom craft equipment production count</b> display will be temporarily paused.\n\n<b>Bug Fixes</b>\n\n- Fixed a bug where an error occurred when removing equipped items."
        }
    ]
}