{
    "NoticeData": [
        {
            "Header":"[Patch Note] v100350",
            "Date":"22.12.2022",
            "Contents":"Planned for realease On 21th Dec, 2022.\n<size=200%>[Improvement]</size>\nWinter Seasonal Event Starts\nShow main lobby winter event set\nFull loading image winter event display\nChange the v100350 Title Background\nWinter event dungeon/recipe open\nThe winter event dungeons will run from December 23, 2022 (5687001 block) to January 20, 2023 (5886000 block).\nUpdate event dungeon convenience\nGuide quests for the highest event dungeon that can be challenged in the main lobby will always appear.\nA red alert is added to the highest stage that can be challenged on the stage selection screen.\nIf you run out of tickets on the Event Dungeon Results screen, you can immediately purchase tickets and try again on the next stage or the current stage without returning to the Ready screen or lobby.\n\nAdd crystal (per price) optione to the shop sorting options.\nThis is the part where the sorting function is added to display the most efficient equipment first by dividing the crystals that can be obtained during grinding.\nEvent banners and pop-ups in the main lobby have been renewed and the ability to check release notes has been added.\nChanged Stage Sweep Required CP (decreased figures required for Sweep)\nThe Sweep Required CP change also changes the Stage Recommended CP.\nStage Recommended CP Formula : Stage Sweep Required CP *1.25\n\nAdded World Boss Battle Sfx.\nRunpage UI improvement, sound effect modification\nUI Optimization, Improved frame due to reduced overall memory usage.\n<size=150%>[Bugfix]</size>\n[Arena] Correction of the phenomenon of high CP output in Arena detail list\n[Arena] Fixing the phenomenon of different user's runes being output differently\n[Arena] Correction of background abnormalities in the period marking part of the arena\n[Sweep] Fixed a phenomenon with 10 AP-port defaults when entering the sweep\n[Redeem code] Redeem code pop-up error correction\n[World Boss] Correction of abnormalities in the background image of the World Boss period display part\n[Inventory] Correct the green arrow on equipment with the same CP\n[Main lobby] Correct the phenomenon of incorrect output of the CONFORM message when refilling the prosperity box\n[Adventure] Fixing the phenomenon that the last food box looks lifted in the early stages of entry"
        },
        {
            "Header":"[Patch Note] v100340",
            "Date":"14.12.2022",
            "Contents":"Planned for release On 14th Dec, 2022.\n<size=200%>Features</size>\nAdded run production and level-up capabilities\nWorkshop - Update of 5 types of rune open and level-up functions through rune pieces\n| Rune | Type | Grade | Effect | Usable Contents | \n| Fenrir HP Run | Stat | Rare | HP Increase | Adventure / World Boss | \n| Fenrir ATK Run | Stat | Epic | ATK Increase | World Boss | \n| Fenrir Bleeding Run | Skill | Unique | Bleeding Effect and Increase ATK | All | | \n| Adventurer's Rune | Stat | Normal | Increase HP | All | \n| Golden leaf Run | Skill | Unique | Damage Reduction Effect and Increase HIT | All |\nWorld Boss - When selecting a rune piece, update the ability to immediately go to the appropriate rune menu in the workshop\nAdded a new Rune sculpture acquisition destination\nAdventurer's Rune Sculpture: Earned together when charging AP as a reward for prosperity.\nGolden Leaf Rune Sculpture: Earned Staking Rewards\nRevised Inventory UI\nAdd rune slots and reorganize to manage integrated slots such as equipment/costume/title\nBreak down into Adventure/Arena/World Boss tabs to set equipment for each content\nInventory to update rune mounting and related functions\nRevised Battle Preparation Screen UI\nUpdate rune mounting and related functions on the battle ready screen\nWhen the left tab (Equipment/Food/Rune/Costium/Material) is pressed, correct to output the slot associated with each tab\nAdventure - Recommended CP output, modified to recognize dominance/underdogs as text color (red/green) compared to my CP\nArena - Enemy CP output\n<size=150%>Improve UI and fix bugs<size>\n[World Boss] Correct the phenomenon of S-rated effects out of range in the rating reward pop-up\n[World Boss] Improvement to check the other party's equipment information in the ranking list\n[Arena] Fixing the phenomenon that the equipment tab becomes smaller when selecting the costume tab on the battle preparation screen\n[Production] Correcting the phenomenon in which the number of ingredients required for the event recipe is out of the area\n[Craft] Modifying the phenomenon of showing recipe slots in the equipment and food production information UI"
        }
    ]
}