{
    "NoticeData": [
        {
            "Header": "v200170",
            "Date": "30.04.2024",
            "Contents": "<b>Rune Level Bonus System Update</b>\n\n- A Rune Level Bonus system has been updated, which applies a stat bonus to equipped runes based on the total level of all runes.\n- Receive bonuses ranging from a minimum of 30% up to a maximum of 1000%! It's a great opportunity to level up your runes.\n- Detailed explanations will be provided through Medium.\n\n<b>Multi-Level Rune Upgrade Feature Update</b>\n\n- Improved to allow leveling up to a maximum of 30 rune levels at once!\n- The success rate for all rune enhancements has been changed to 100%!\n- For levels previously under 80%, the upgrade costs have been adjusted to match the 100% standard.\n\n<b>Addition of 2 New Runes</b>\n\n- Two new Sacred-grade runes have been added:\n    - One skill rune and one stat rune, detailed specs can be checked through Medium.\n    - These runes, including future Sacred-grade rune stones, are non-tradable.\n- These runes can be obtained through Workshop - Summon - Golden Rune Summon.\n\n<b>May Event</b>\n\n- Rune Level Bonus Update Celebration Event\n    - Throughout May, the world bosses Odin and Heimdall will continue without breaks.\n    - World boss battle rewards & grade rewards for rune stones will increase by 1.5 times.\n- Crystal Equipment Material Drop Event\n    - During the event period, stages 150, 200, 250, and 300 will drop crystal equipment materials instead of usual materials.\n    - Use these materials to craft crystal equipment and grind to obtain crystals, which will be a great help on your future adventures.\n    - Detailed probabilities and explanations about crystal equipment can be checked through Medium.\n\n<b>Season Pass Rune Master (May 2024) Update</b>\n\n- A season pass that allows you to obtain the title of Rune Master has been updated.\n    - The Rune Master title is designed to provide excellent support in adventure missions.\n- For premium pass users, there is a new feature to receive unclaimed rewards from the previous season for a week after the new season starts.\n\n<b>Game Improvement</b>\n\n- Stage rebalancing from stage 151 to 359 to aid adventurers in entering the 8th world.\n- Adjustments made to reduce the number of blocks required for enhancing 8th world equipment.\n- A correction was made to the def stat of some 8th world ring equipment which was incorrectly configured.\n- Some collections have been upgraded and new collections have been added.\n- A feature to back up the key file containing account information on the mobile start screen has been added.\n- Equipment tooltips now display the experience held by the equipment.\n- Before crafting, the equipment recipe now shows the experience the equipment will hold initially.\n- The recipe section displays the number of related collections and the achievement numbers.\n- The crystal acquisition calculation from equipment grinding has been changed.\n    - It increases up to 5 enhancements, and thereafter, the same amount as 5 enhancements will be granted.\n    - The maximum pure acquisition per piece of equipment is limited to 100 million crystals, excluding the staking bonus.\n\n<b>Bug Fixes</b>\n\n- Fixed an issue where arena ticket information was not updating properly after use.\n- Fixed an issue where personal information was not updating properly in the arena list.\n- Fixed an issue where the actual outcome and the simulation during stage progression were different."
        },
        {
            "Header": "v200160",
            "Date": "27.03.2024",
            "Contents": "<b>New World 8 Added</b>\n\n- New World 8, HELHEIM, has opened!\n    - 50 stages, ranging from 351-400, have been added.\n- New grade, Sacred Class equipment has been added!\n    - Recipes for making a total of 25 types of equipment, including weapons, armor, belts, necklaces, and rings, have been added, with 5 kinds for each type.\n- 6 new types of food have been added!\n    - Recipes for crafting these 6 types of food have been added.\n- Level data up to a maximum of 500 levels has been added.\n\n<b>Collection System Improvements</b>\n\n- Convenience features have been added to the collection system.\n    - A shortcut feature to obtain the materials needed for the collection has been added.\n    - The collection list sorting function has been improved.\n        - It is sorted in the order of immediate completion possible, some conditions met, and no progress made.\n    - A shortcut to the collection menu from the crafting menu has been added.\n    - Stats obtained from the collection can be checked in the stage, arena, and world boss battle preparation screens.\n\n<b>In-Game Monster Collection Improvement</b>\n\n- A presentation for checking items received when collecting monster collection rewards has been added.\n- The main lobby now displays information related to monster collection progress.\n    - It shows the level and the remaining time until reward claim.\n- Migration feature added\n    - When rewards are updated, migration can be conducted to renew the agreement with new rewards.\n\n<b>April Event</b>\n\n- Balance adjustments in celebration of the World 8 update.\n    - The block and required material quantities for crafting equipment in Worlds 1-7 have been changed.\n\n<b>Game Improvements</b>\n\n- The collection list has been expanded, and some reward balances have been adjusted.\n- The SKIP feature for World Bosses now skips the entire battle.\n- A retry button has been added after clearing the last stage of the event dungeon.\n- The maximum amount of AP potion that can be used with the SWEEP feature during stage progression has been increased from 10 to 20.\n- The REPEAT feature during stage progression now allows for the use of 1 bottle of AP potion.\n- The crystal substitute cost for crafting equipment with legendary-grade materials has been reduced by 33%."
        },
        {
            "Header": "v200150",
            "Date": "28.02.2024",
            "Contents": "<b>Collection System Update</b>\n\n- A collection system has been added that allows players to gather equipment, food, costumes, titles, and materials to acquire Stats.\n- The stats obtained through this system include two types: the existing + stats and the % stats, which are being added for the first time.\n    - % stats are calculated in combination with existing skill buffs, applying the percentage after summing all + stats.\n    - CDMG is an abbreviation for Critical Damage, a stat that increases the additional damage dealt on a critical hit.\n\n<b>Monster Collection In-Game Start, Change, and Claim Feature Added</b>\n\n- The functionality to start Monster Collection, change amounts, and claim rewards, which was previously only possible through the PC version launcher, has been made available in-game for players.\n- As a result, users who do not use the PC version can also receive various rewards through the Monster Collection.\n\n<b>Monster Collection Ruby Dust Reward Added</b>\n\n- Ruby Dust, used in the collection, has been added as a reward for the Monster Collection.\n- Plans are in place to provide various uses for this material item in the future.\n\n<b>SPD Related Combat Processing Change</b>\n\n- The display of stats owned by players has been changed to not use decimals.\n- In arenas, world bosses, and stages, the processing of speed after using a skill, which was previously treated the same as attacks, has been changed. Now, when a skill is used, the SPD value is recalculated by multiplying by 0.9 instead of 0.6. Through these changes, the probability of taking another turn after using a skill has significantly increased.\n- This change aims to reduce the cost of using skills, thereby increasing the value of skill equipment and emphasizing the diversity of combat strategy with skill use going forward.\n\n<b>Bugfix</b>\n\n- Fixed an issue where the announcement image did not display in the main lobby at the start of the World Boss season.\n- Fixed an issue where the levels of avatars in the arena were displayed abnormally."
        }
    ]
}