{
  "NoticeData": [
    {
      "Header": "v200400",
      "Date": "27.01.2026",
      "Contents": "## <b>Game Improvements</b>\n\n- <b>Event Dungeon SWEEP Added</b>\n    - You can now quickly claim rewards from event dungeons by using <b>SWEEP</b> based on the number of tickets you own.\n- <b>Increased Stage SWEEP Max AP Potion Usage</b>\n    - Previous: Max <b>20</b>\n    - Updated: Max <b>100</b> potions\n- <b>Increased Stage REPEAT Max AP Potion Usage</b>\n    - Previous: Max <b>1</b>\n    - Updated: Max <b>5</b> potions\n- <b>Reduced World Boss Repeat Block Interval</b>\n    - Previous: Once every <b>5 blocks</b>\n    - Updated: Once every <b>1 block</b>\n    - At the beginning of the update, the interval was set to ensure a similar experience across all environments due to the lack of animation skip. With this change, faster progression is now possible.\n- <b>Rune Level Cap Adjustment on Initial Unlock</b>\n    - Previously, newly unlocked runes were limited to emphasizing the “open” feature rather than upgrading.\n    - This has been adjusted so that newly unlocked runes can now be leveled up to <b>Level 30</b>, depending on available materials, allowing faster progression.\n- <b>Collection Sorting Improvements</b>\n    - Previous: Displayed in descending order based on the time added\n    - Updated: Collections are now grouped by <b>% reward priority</b>, then sorted by <b>total reward value</b> in descending order\n- <b>21 New Collections Added</b>\n\n## <b>Infinite Tower Season 3 Data Added</b>\n\n- Added content for <b>Infinite Tower Season 3</b>, which will run throughout <b>February</b>\n    - <b>Skill Runes and Auras disabled</b>\n    - Increased the number of conditions applied per floor to provide a more varied experience\n    - <b>Maximum CP significantly increased</b>\n    - Chains with <b>5 or more players reaching Floor 100</b> this season will unlock <b>additional floors in the next season</b>, so we encourage your participation\n\n## <b>2nd Anniversary Event Ended</b>\n\n- <b>2nd Anniversary Event Popup Closed</b>\n    - Patrol rewards have been restored to their original state\n- <b>Thor Event Conclusion</b>\n    - After the currently ongoing World Boss, no further content such as Arena, World Boss, or Infinite Tower is scheduled for Thor.\n    - The period opened to allow players to return <b>staked assets and held NCG</b> to their original chains during February will be closed, so please plan accordingly to avoid any inconvenience.\n\n<b>Bug Fixes</b>\n\n- Fixed an issue where <b>season rewards could not be properly claimed</b> when the <b>Fenrir-type World Boss</b> was active."
    },
    {
      "Header": "v200390",
      "Date": "23.12.2025",
      "Contents": "## <b>Infinite Tower 2nd season</b>\n\n- This season, Aura and Water/Wind attribute equipment cannot be used on any floor.\n- Starting this season, the probability of each condition being selected will be displayed.\n- Starting this season, the conditions selected for each floor will be shown when you enter the floor.\n- The resources required to enter each floor have also been simplified.\n- From next year, we are considering a system where seasonal conditions for the Tower of Infinity will be proposed by the community. We look forward to your ideas and participation.\n\n## <b>25 Last Event Dungeon - Golden Dust Valut Open</b>\n\n- A year-end seasonal event dungeon where you can obtain Golden Dust and Sapphire Dust has been added.\n\n## <b>NCU 2nd Project – Teaser Banner Update</b>\n\n- A new NCU project is on the way — one that both new players on a new platform and long-time Nine Chronicles fans will be able to enjoy together.\n- In this project, you’ll play through content tied to Nine Chronicles’ main story, *Odin’s Conspiracy*. We’re also working hard on features that let you make payments with WNCG in external environments.\n- In addition, we’re carefully reviewing many of the high-quality projects from the recent game jam to see if they can be integrated into NCU. We’d really appreciate your interest and support.\n\n## Game Improvements\n\n- A red dot indicator is now shown on the 2nd Anniversary event popup when Recon rewards are available to claim."
    },
    {
      "Header": "v200380",
      "Date": "25.11.2025",
      "Contents": "## <b>Infinite Tower Open</b>\n\n- <b>The Infinite Tower is a feature designed to offer a wide range of experiences by introducing various conditions and challenges. This initial release is just the first step, and we plan to continue improving it in many ways. We truly appreciate any suggestions you may have, so please feel free to share them with us.</b>\n\n- A challenge-based content that <b>resets once every month</b>.\n- Contains <b>exclusive rewards</b> obtainable only within the Tower.\n    - In this season, clearing <b>Floor 51</b> grants a <b>Mythic-grade costume</b>.\n- Each floor requires specific <b>entry conditions</b> and applies <b>unique buffs</b>, which players must overcome to win the battle.\n- Tickets recharge <b>every 12 hours</b>.\n    - In the Previewnet version, players can attempt more runs thanks to Sapphire Dust rewards from patrol.\n- The Tower initially launches with <b>up to 100 floors</b>, and if enough players reach the final floor in a season, <b>additional floors</b> will be unlocked in the next season.\n\n## <b>2nd Anniversary Event Open</b>\n\n- <b>2nd Anniversary Event Dungeon</b> is now available.\n    - Obtain 100% of all rewards including <b>AP Potions, Dust, Hammers</b>, and more.\n    - Anniversary <b>Grimoire and Aura</b> can be crafted using event materials.\n- Obtain the <b>2nd Anniversary Mythic-grade Costume and Title</b>.\n    - These items receive <b>additional buffs only during the event period</b>, and will return to their original stats afterward.\n    - They <b>cannot be used as Synthesis materials</b>, nor can they be obtained through Synthesis results.\n- <b>Two free Rune Slots unlocked</b>\n    - One Skill Rune Slot and one Stat Rune Slot are added for free.\n    - We hope this allows for more diverse builds and enjoyable adventures.\n\n## <b>New Costumes Added</b>\n\n- Two new costumes for the <b>2025 Autumn Championship Winners</b> have been added.\n    - The <b>2025 Summer Championship Winner</b> costumes are no longer obtainable through Summon or Fusion.\n    - The Autumn Champion costumes will only be obtainable <b>until the Winter Champion costumes are released</b>.\n- Two new costumes: <b>Avatar of Infinity</b> and <b>Avatar of Defense</b>\n    - The <b>Avatar of Infinity</b> costume can be obtained <b>exclusively from the Infinite Tower</b>.\n    - The <b>Avatar of Defense</b> costume can be obtained through <b>Costume Summon</b>.\n\n## The seasonal planet - Thor re-opened\n\n- The upcoming seasonal planet will run from <b>November 25, 2025 to Thursday, January 29, 2026</b>.\n- More details will be shared via our Medium post after the launch tomorrow.\n\n## Portal Shop Open\n\n- A <b>market feature</b> will be added to the <b>Play section</b> of the Nine Chronicles portal site.\n- Through this page, <b>all packages that were previously only purchasable on mobile will also be available on PC</b>.\n- To ensure service stability and prevent mission abuse, <b>the portal shop will only be available to users at level 300 or above</b>.\n\n## Game Improvement\n\n- <b>4 new Mythic Costumes</b>\n    - Added 2 costumes from the <b>2025 Autumn Championship Winner series</b>\n        - The 2 costumes from the <b>2025 Summer Championship Winner series</b> can no longer be obtained via Costume Summon or Combination.\n    - Added <b>1 new Infinite Tower reward–exclusive costume</b>\n    - Added <b>1 new costume exclusive to Costume Summon</b>\n- <b>20 new Collections</b>\n    - <b>9 new equipment-related Collections</b> for the 2nd anniversary\n    - <b>10 new material-related Collections</b>\n    - <b>1 new Season Pass Collection</b>"
    }
  ]
}