{
    "NoticeData": [
        {
            "Header": "v200170",
            "Date": "30.04.2024",
            "Contents": "<b>룬 레벨 보너스 시스템 업데이트</b>\n\n- 전체 룬의 레벨 합에 따라 장착한 룬에 스탯 보너스를 적용해주는 룬레벨 보너스 시스템이 추가되었습니다.\n- 최소 30%에서 최대 700%까지의 보너스를 받을 수 있는 시스템! 룬 레벨업을 할 찬스입니다.\n- 자세한 설명은 미디엄을 통해 안내될 예정입니다.\n\n<b>룬 멀티 레벨업 기능 업데이트</b>\n\n- 최대 30까지의 룬레벨을 한번에 올릴 수 있도록 개선되었습니다!\n- 모든 룬의 강화 성공 확률이 100% 로 변경되었습니다!\n- 기존 80% 이하의 레벨구간에 대해서는 업그레이드 비용이 100% 기준에 맞춰서 증가되도록 변경되었습니다.\n\n<b>신규 룬 2종 추가</b>\n\n- 신성 등급 룬 2종이 추가되었습니다.\n    - 스킬 룬 1종, 스탯 룬 1종으로, 자세한 스펙은 미디엄을 통해 확인 가능합니자!\n    - 해당 룬을 포함하여 이후 나올 신성등급 룬 조각은 거래 불가 합니다.\n- 해당 룬들은 워크샵 - 소환 - 골든 룬 소환을 통해 획득 가능합니다.\n\n<b>5월 이벤트</b>\n\n- 룬레벨 보너스 업데이트 기념 이벤트\n    - 5월 한달동안 오딘과 헤임달의 월드보스가 쉬는 기간없이 연속해서 진행됩니다.\n    - 월드 보스 전투보상 & 랭크보상의 룬조각이 1.5배로 증가합니다.\n- 크리스탈 장비 재료 드롭 이벤트\n    - 150, 200, 250,300 스테이지에서 이벤트 기간동안 기존 재료가 아닌 크리스탈 장비 재료가 드랍됩니다.\n    - 해당 재료를 사용하여 크리스탈 장비를 제작후 그라인딩하여 크리스탈을 확보하세요! 모험가 분들의 이후 여정에 큰 도움이 될 것입니다.\n    - 자세한 확률가 크리스탈 장비에 대한 설명은 미디엄을 통해 확인 가능합니다.\n\n<b>시즌패스 rune master (24년 5월) 업데이트</b>\n\n- 룬 마스터 칭호를 획득할수 있는 시즌패스가 업데이트 되었습니다.\n    - 룬 마스터 칭호는 어드벤쳐 모험에 매우 탁월한 지원을 해주는 칭호로 디자인 되었습니다.\n- 프리미엄 패스 이용자를 대상으로, 신규 시즌 오픈 이후 일주일간 지난 시즌의 미수령 보상을 받을 수 있는 기능이 추가 되었습니다.\n\n<b>게임 개선</b>\n\n- 모험가님들의 8월드 진입을 돕기 위해 스테이지 151~359 stage 리밸런싱 되었습니다.\n- 8월드 장비의 강화에 필요한 block 을 기존보다 적게 필요하도록 조정하였습니다.\n- 8월드 일부 반지 장비의 def stat이 의도와 다르게 들어가있는게 확인되어 수정 되었습니다.\n- 일부 컬렉션이 보상 상향 수정 되었습니다.\n- 일부 컬렉션이 추가 되었습니다.\n- 모바일 스타트 화면에서 계정정보가 담긴 키파일을 백업하는 기능을 추가했습니다.\n- 장비 툴팁에서 해당 장비가 보유한 경험치를 표시합니다.\n- 장비 레시피에서 제작하기전 해당 장비의 최초 제작시 보유 경험치를 표시합니다.\n- 장비 레시피에서 해당 레시피 관련 컬렉션의 숫자 및 달성 숫자를 표시합니다.\n- 장비 그라인딩신 크리스탈 획득량 계산이 변경되었습니다.\n    - 최대 5강까지만 증가하며 이후 강화시에는 5강과 동일량을 지급합니다.\n    - staking bonus를 제외한 순수 획득량이 장비 1개당 최대 1억 크리스탈로 제한됩니다.\n\n<b>버그 수정</b>\n\n- 아레나 티켓 사용후 티켓 정보가 제대로 갱신되지 않던 문제를 수정했습니다.\n- 아레나 리스트에서 내정보가 갱신이 제대로 되지 않던 문제를 수정했습니다.\n- 스테이지 진행 도중 실제 결과와 연출 시뮬레이션의 결과가 서로 다르던 문제를 수정했습니다."
        },
        {
            "Header": "v200160",
            "Date": "27.03.2024",
            "Contents": "<b>8월드 추가</b>\n\n- 신규 월드 8, HELHEIM이 열렸습니다!\n    - 351-400, 50개의 스테이지가 추가되었습니다.\n- 신규 등급, 신성 클래스 장비가 추가되었습니다!\n    - 무기, 갑옷, 벨트, 목걸이, 반지 타입별 5종씩 총 25종 장비를 제작할수 있는 레시피가 추가되었습니다.\n- 신규 음식 6종이 추가되었습니다!\n    - 6종의 음식을 제작할 수 있는 레시피가 추가되었습니다.\n- 최대 500 레벨까지의 레벨 데이터가 추가되었습니다.\n\n<b>컬렉션 시스템 개선</b>\n\n- 컬렉션 편의 기능이 추가되었습니다.\n    - 컬렉션에 필요한 재료를 획득할 수 있는 바로가기 기능이 추가되었습니다.\n    - 컬렉션 리스트 정렬 기능이 개선되었습니다.\n        - 즉시 완료 가능, 일부 조건 달성, 조건이 진행되지 않은 순서로 정렬됩니다.\n    - 제작 메뉴에서 컬렉션 바로 가기 기능이 추가되었습니다.\n    - 스테이지, 아레나, 월드보스 전투 준비화면에서 컬렉션에서 획득한 스탯을 확인할 수 있습니다.\n\n<b>인게임 몬스터 콜렉션 개선</b>\n\n- 몬스터콜렉션 보상 수령시, 받은 아이템 확인 연출이 추가되었습니다.\n- 메인로비에서 몬스터 콜렉션 진행 관련 정보를 표시하도록 개선했습니다.\n    - 레벨 및 보상 수령까지 남은 시간정보를 알려줍니다.\n- 마이그레이션 기능 추가\n    - 보상이 업데이트 될 경우, 마이그레이션을 진행하여 새로운 보상으로 계약을 갱신할 수 있습니다.\n\n<b>4월 이벤트</b>\n\n- 8월드 업데이트 기념 밸런스 조정\n    - 1-7월드 장비 제작 블록 및 필요 재료수량이 변경됩니다.\n\n<b>게임 개선</b>\n\n- 컬렉션 리스트가 추가되고, 일부 보상 밸런스가 변경되었습니다.\n- 월드보스 SKIP 이 전체 전투를 스킵하도록 수정되었습니다.\n- 이벤트 던전 마지막 스테이지 클리어 후 다시하기 버튼이 추가되었습니다.\n- 스테이지 진행시 SWEEP 기능의 AP포션 최대 사용량이 10 → 20 으로 증가하였습니다.\n- 스테이지 진행시 REPEAT 기능에서 AP포션을 1병 사용 가능하게 되었습니다.\n- 장비 제작시 legendry 등급 재료의 crystal 대체비용이 33% 감소되었습니다."
        },
        {
            "Header": "v200150",
            "Date": "28.02.2024",
            "Contents": "<b>컬렉션 시스템 업데이트</b>\n\n- 장비와 음식, 코스튬, 칭호, 재료를 모아서 Stat 을 획득하는 컬렉션 시스템이 추가되었습니다.\n- 해당 시스템을 통해 획득하는 stat은 기존의 + 스탯과, 이번에 처음으로 추가되는 % 스탯, 2종류가 있습니다.\n    - % 스탯의 경우 기존 스킬 버프와 합쳐져서 계산되며, + 스탯을 다 더한 이후에 %가 곱해집니다.\n    - CDMG 는 Critical DaMaGe 의 줄임말로, 크리티컬 발생시 추가 데미지량을 증가시켜주는 스탯입니다.\n\n<b>몬스터 콜렉션 게임내에서 시작 및 변경과 보상받기 기능 추가</b>\n\n- 기존 PC버전의 런처에서만 진행가능하던 몬스터 콜렉션 시작하기 및 금액 변경, 보상받기등이 플레이어에서도 진행 가능하도록 변경되었습니다.\n- 이에 따라 PC버전을 이용하지 않는 유저분들도 몬스터 콜렉션을 통해 다양한 보상을 받아보실수 있습니다.\n\n<b>몬스터 콜렉션 루비 더스트 보상 추가</b>\n\n- 컬렉션에서 재료로 사용되는 루비 더스트를 몬스터 콜렉션 보상으로 추가합니다.\n- 추후에는 해당 재료아이템을 사용한 다양한 사용처를 제공해드릴 예정입니다.\n\n<b>SPD 관련 전투 처리 변경</b>\n\n- 플레이어가 보유한 스탯을 표시하던 부분에서 소수점을 사용하지 않게 변경되었습니다.\n- 아레나, 월드보스, 스테이지에서 스킬을 사용한 이후에 스피드 처리가 공격과 동일하게 처리되던 부분을 스킬 사용시에는 SPD 수치를 0.6이 아닌 0.9 를 곱해서 재계산하도록 변경하였습니다. 이러한 변경을 통해 스킬사용후 다음번에 자기 차례를 다시 가지게 될 확률이 매우 높아졌습니다.\n- 이를 통해 스킬 사용비용이 감소되어 좀더 스킬 장비의 가치를 올리고 스킬 사용에 따른 전투 전략의 다양성을 앞으로도 지속적으로 강조할 예정입니다.\n\n<b>Bugfix</b>\n\n- 월드보스 시즌 시작시 메인로비에서 안내 이미지가 표시되지 않던 현상을 수정했습니다.\n- 아레나에서 아바타들의 레벨이 비정상적으로 표시되던 현상을 수정했습니다."
        }
    ]
}