{
    "NoticeData": [
        {
            "Header":"[Patch Note] v200120",
            "Date":"13.12.2023",
            "Contents":"<b>Golden Rune Summon</b> \n- Rune stones can now be summoned using Golden Dust in Workshop - Summon. \n- You can summon World Boss runestones and new runestones that can only be found this time in the corresponding menu. \n- The cost of a single summon is 20 Golden Dust, and you will receive 10 Rune Stones. \n- The 11-time summon costs 200 Golden Dust, the same as the aura. \n \n<b>Introducing 8 new runes</b> \n- We're adding 8 new runes that can be obtained through Rune Summoning. \n- Starting with this update, runes will be more content-specific, with different skills and stats. \n- Please visit Medium for more details on how they'll be introduced. \n \n<b>Christmas decorations to the main lobby</b> \n- We're adding Christmas decorations to the main lobby for the holidays. \n- Starting with the decorations, there will be a variety of events, so we hope you all enjoy a happy Nine Chronicles."
        },
        {
            "Header":"[Patch Note] v200110",
            "Date":"22.11.2023",
            "Contents":"<b>Nine Chronicles M is now open!</b>\nYou can find the mobile version of Nine Chronicles on various countries' Google Play and App Store.\n\n<b>Multiplanetary: Introducing a new network system</b>\nThe existing Nine Chronicles mainnet had limitations on the total transaction volume it could handle.\nAlso, due to the accumulated play records over the past few years, there were difficulties in competing in the new system.\nTo overcome these issues, we are introducing Multiplanetary, which supports more than two networks.\n\n- The play records of the existing mainnet will be named Odin and can be played as before.\n- With the introduction of the Multiplanetary system, a new network named Heimdall will be launched.\n- Each network is named after a planet and has independent play records and economic systems.\nFor more details, please refer to the following link: [https://bit.ly/9C_M_New_Chain_Heimdall](https://bit.ly/9C_M_New_Chain_Heimdall)\n\n<b>Balance adjustment</b>\nVarious values will be changed to allow early users to enjoy various equipment crafts and adventure experiences.\nThe initial reinforcement cost is reduced, and the initial experience points for equipment crafting, as well as clear rewards for each world, are increased compared to before.\n\n<b>New Aura release</b>\nAegis Aura (ARENA SPECIAL) and Barrage Aura (ADVENTURE SPECIAL), which can be summoned with Golden Dust, have been added.\nCheck the summon menu for more details.\n\n<b>Season Pass system added</b>\nA Season Pass system has been added, allowing you to receive various rewards with Courage Experience that accumulates just by playing game.\n"
        },
        {
            "Header":"[Patch Note] v200091",
            "Date":"13.10.2023",
            "Contents":"<b>[ Improvement ]</b>\n\nAdd rewards when creating new avatars\n- Crystal 200000, Long Sword, Casual Clothes\n\nChange Lobby Image\n- Rearrange background and each content location\n\nChange the loading image\n- Display loading images by adventure, arena, shop, workshop content\n\nChange New Avatar Tutorial\n\n<b>[ Bugfix ]</b>\n\nCorrected the part where the acquired crystal calculation is not properly calculated when grinding the upgraded aura."
        }
    ]
}
