{
    "NoticeData": [
        {
            "Header": "v200150",
            "Date": "28.02.2024",
            "Contents": "<b>컬렉션 시스템 업데이트</b>\n\n- 장비와 음식, 코스튬, 칭호, 재료를 모아서 Stat 을 획득하는 컬렉션 시스템이 추가되었습니다.\n- 해당 시스템을 통해 획득하는 stat은 기존의 + 스탯과, 이번에 처음으로 추가되는 % 스탯, 2종류가 있습니다.\n    - % 스탯의 경우 기존 스킬 버프와 합쳐져서 계산되며, + 스탯을 다 더한 이후에 %가 곱해집니다.\n    - CDMG 는 Critical DaMaGe 의 줄임말로, 크리티컬 발생시 추가 데미지량을 증가시켜주는 스탯입니다.\n\n<b>몬스터 콜렉션 게임내에서 시작 및 변경과 보상받기 기능 추가</b>\n\n- 기존 PC버전의 런처에서만 진행가능하던 몬스터 콜렉션 시작하기 및 금액 변경, 보상받기등이 플레이어에서도 진행 가능하도록 변경되었습니다.\n- 이에 따라 PC버전을 이용하지 않는 유저분들도 몬스터 콜렉션을 통해 다양한 보상을 받아보실수 있습니다.\n\n<b>몬스터 콜렉션 루비 더스트 보상 추가</b>\n\n- 컬렉션에서 재료로 사용되는 루비 더스트를 몬스터 콜렉션 보상으로 추가합니다.\n- 추후에는 해당 재료아이템을 사용한 다양한 사용처를 제공해드릴 예정입니다.\n\n<b>SPD 관련 전투 처리 변경</b>\n\n- 플레이어가 보유한 스탯을 표시하던 부분에서 소수점을 사용하지 않게 변경되었습니다.\n- 아레나, 월드보스, 스테이지에서 스킬을 사용한 이후에 스피드 처리가 공격과 동일하게 처리되던 부분을 스킬 사용시에는 SPD 수치를 0.6이 아닌 0.9 를 곱해서 재계산하도록 변경하였습니다. 이러한 변경을 통해 스킬사용후 다음번에 자기 차례를 다시 가지게 될 확률이 매우 높아졌습니다.\n- 이를 통해 스킬 사용비용이 감소되어 좀더 스킬 장비의 가치를 올리고 스킬 사용에 따른 전투 전략의 다양성을 앞으로도 지속적으로 강조할 예정입니다.\n\n<b>Bugfix</b>\n\n- 월드보스 시즌 시작시 메인로비에서 안내 이미지가 표시되지 않던 현상을 수정했습니다.\n- 아레나에서 아바타들의 레벨이 비정상적으로 표시되던 현상을 수정했습니다."
        },
        {
            "Header": "v200140",
            "Date": "19.02.2024",
            "Contents": "<b>립플래닛 업데이트</b>\n\n- 액티비티 처리 속도를 빠르게 조정\n- 데이터 구조 최적화"
        },
        {
            "Header": "v200132",
            "Date": "31.01.2024",
            "Contents": "<b>길드전 이벤트 준비</b>\n\n- 헤임달 체인의 아레나 시즌 3동안 진행될 길드 이벤트 관련 기능들이 업데이트 되었습니다.\n\n<b>모바일 샵 이벤트 준비</b>\n\n- 모바일 샵에서 무료 상품을 구매하는 이벤트 관련 기능이 업데이트 되었습니다.\n\n<b>버그 수정</b>\n\n- 몬스터 콜렉션 골든더스트, 실버더스트, 골든 미트의 거래가능 여부가 잘못 설정되어 지급되는 버그 수정\n- hit 수치가 일정수치 이상으로 높은 수치일때 miss 계산이 잘못되던 버그 수정\n- 각 메뉴에서 종료된 이벤트를 안내해주던 버그 수정"
        },
        {
            "Header": "v200130",
            "Date": "19.12.2023",
            "Contents": "<b>이벤트 던전 시작</b>\n\n- 2023년 12월 20일부터 2024년 1월 9일까지 골든더스트, 실버더스트, AP포션과 모래시계등의 다채로운 아이템 및 10이상의 경험치를 제공하는 이벤트 던전이 오픈될 예정입니다.\n\n<b>크리스탈 룬 슬롯 추가</b>\n\n- 스탯룬과 스킬룬을 장착할수 있는 룬슬롯을 5M, 50M 으로 오픈할수있는 기능이 추가되었습니다.\n\n<b>DCC Pet 기능 추가</b>\n\n- 소울스톤을 사용하여 오픈가능하며, 제작에 도움을주는 펫 기능이 추가되었습니다.\n- 소울스톤은 PC버전을 이용하시거나 모바일 샵에 곧 추가될 패키지등에서 획득 가능하십니다.\n\n<b>버그 수정</b>\n\n- 아레나나 스테이지에서 장착하고 계셨던 장비가 벗겨지는 현상을 수정했습니다."
        }
    ]
}