{
    "NoticeData": [
        {
            "Header": "v200200",
            "Date": "09.07.2024",
            "Contents": "<b>アドベンチャーボスシステムの追加</b>\n\n- アドベンチャーボスシステムが追加されました。\n    - プレイヤーはNCGを使って運営ユーザーになり、ゴールデン、ルビー、エメラルドダストや新しいクリティカルルーンストーンを報酬として受け取ることができます。\n    - APポーションを使って討伐に参加し、ハンマーやNCG、ダスト、新しいルーンストーンを報酬として受け取ることができます。\n        - 参加したプレイヤーの中からランダムで1人に、運営額の5%に相当するNCGが報酬として与えられます。\n        - 参加したプレイヤーは、貢献度に応じて運営額の15%に相当するNCGを分け合います。\n    - アドベンチャーボスのオープンタイミングは、プレイヤーの分散型の参加によって決定され、オープン後4時間以内にボスを倒す必要があります。一度シーズンが終了すると、10800ブロック後に再オープンが可能です。\n- アドベンチャーボスシステムの詳細については、以下の記事をご確認ください。\n    - [Introducing Adventure Boss](https://medium.com/nine-chronicles/9cm-introducing-adventure-boss-eda4712cd2e2)\n\n<b>グリモア装備と召喚システムの追加</b>\n\n- エメラルドダストを使用して召喚可能なグリモア装備が追加されました。\n    - 召喚で取得した装備は、基本的に取引不可属性を持ちます。\n    - 今回追加されたグリモア装備は、3つのスキルタイプ、4つのグレード、3つのサブステータスで構成された合計36種類の装備が追加されました。\n- グリモア装備は、新たに追加されたグリモア装備スロットに装着できます。\n- エメラルドダストは、アドベンチャーボスシステムの運営報酬および討伐報酬として取得可能です。\n\n<b>ゲーム改善</b>\n\n- 装備制作のバランス変更\n    - エピック、ユニーク、レジェンダリー、聖級の装備制作体験が大幅に改善されました。\n        - プレミアムレシピの制作コストが大幅に軽減されました。\n            - 制作に必要な材料量と制作時に発生する待機ブロックが大幅に減少しました。\n        - 装備にスキルが付与される確率が大幅に増加しました。\n        - レシピ解除に必要なクリスタルが大幅に減少しました。\n    - ノーマル、レア、エピック、ユニーク級装備の強化に必要なNCGが50%減少しました。\n- ステージバランスの変更\n    - ワールド6、7、8のモンスターのステータスが大幅に減少しました。\n- ワールドボスランキング計算方法の変更\n    - ランキング方式の一貫した体験を確保するために、ワールドボスのランキング計算方法がアリーナスタイルに変更され、同点の場合は下位にランクされるようになりました。\n    - 現在、Sランクで同点者が多数発生し、ランキングの差別化が不足している問題は、今四半期にコミュニティと協力して修正していく予定です。\n- 11種類の新コレクションの追加\n    - 新たに導入されたエメラルドダストと6月シーズンパス称号に関連するコレクションが追加されました。"
        },
        {
            "Header": "v200190",
            "Date": "01.07.2024",
            "Contents": "<b>ゲーム改善</b>\n\n- libplanetのアップデートにより、ブロック生成時間が安定化される予定です。\n- 食品使用のUX改善：\n    - インベントリでは、同じIDを持つ食品を個別に表示せず、数量を表示することで、より簡単に使用および確認できるように改善しました。\n    - PCバージョンのショップでは、同じIDの食品を一度に複数登録できるようにUXを改善しました。"
        },
        {
            "Header": "v200180",
            "Date": "07.06.2024",
            "Contents": "<b>ルビー召喚アップデート</b>\n\n- ルビーダストを使用したルビーオーラ、ルビールーン召喚が追加されました。\n- 既存のゴールデンダストルーン召喚と似ていますが、ルーンの召喚確率が異なります。欲しかったルーンの確率が上がったかどうかを確認してください！\n- 召喚の構成および確率の詳細は、ワークショップ - 召喚で確認できます。\n\n<b>新オーラ3種 & ルーン2種追加</b>\n\n- 神聖等級を含むイミルオーラが追加されました。\n    - イミルオーラはユニーク、レジェンダリー、神聖の3種類の等級で取得可能です。\n    - イミルオーラはワークショップ - 召喚メニューのゴールデンオーラおよびルビーオーラ召喚で取得できます。\n- 神聖等級オーディンルーン2種が追加されました。\n    - これらのルーンを含む、今後登場する神聖等級のルーンの破片は譲渡不可属性を持つ予定です。\n    - これらのルーンはワークショップ - 召喚メニューのゴールデンルーンおよびルビールーン召喚で取得できます。\n\n<b>6月イベント</b>\n\n- 偵察報酬の報酬品目にゴールデンダストとAPポーションが追加されます。\n- 新しい装備の制作に必要な待機ブロックが30%減少されます。\n- レベル250以上のプレイヤーにゴールデンダストが支給されます。\n\n<b>ルビーガーディアンパスアップデート</b>\n\n- ルビーガーディアンの称号を取得できるルビーガーディアンパスが発売されました。\n- ルビーガーディアンの称号は、HP 63114、SPD 20872の優れたステータスを付与します。\n\n<b>ゲーム改善</b>\n\n- 一部のコレクションの報酬が上方修正されました。\n- 新しいコレクションが追加されました。\n- ワークショップ - 召喚 - 一般セクションのノーマルオーラ召喚に、レア、エピック、ユニーク等級のオーラが追加されました。\n- ゲーム開始画面に、所持しているQR形のキーをインポートできる機能が追加されました。\n\n<b>バグ修正</b>\n\n- ワールドボスの進行後、アニメーションの再生速度が遅くなるバグが修正されました。\n- オーディンチェーンの一部のユーザーに8番目のワールドクエストが表示されないバグが修正されました。"
        }
    ]
}