{
  "NoticeData": [
    {
      "Header": "v200390",
      "Date": "23.12.2025",
      "Contents": "## <b>Infinite Tower 第2シーズン</b>\n\n- 今シーズンは、すべてのフロアでオーラおよび水/風属性装備を使用できません。\n- 今シーズンから、各コンディションが選択される確率が表示されるようになります。\n- 今シーズンから、フロア入場時に選択されたコンディションが表示されます。\n- 各フロア入場に必要なリソースが、よりシンプルな形に整理されました。\n- 来年からは、インフィニットタワーのシーズンコンディションをコミュニティから募集して採用する仕組みを検討しています。皆さまのアイデアとご参加をお待ちしています。\n\n## <b>25 Last Event Dungeon - Golden Dust Vault Open</b>\n\n- ゴールデンダストとサファイアダストを獲得できる、年末シーズンイベントダンジョンが追加されました。\n\n## <b>NCU 第2プロジェクト – ティザーバナーアップデート</b>\n\n- 新しいプラットフォームの新規プレイヤーと、Nine Chronicles を遊び込んでいるファンの皆さまが一緒に楽しめる、新たな NCU プロジェクトがまもなく登場します。\n- 本プロジェクトでは、Nine Chronicles のメインストーリー「オーディンの陰謀」に関連した内容をプレイできます。また、外部環境で WNCG を用いて決済できる機能についても鋭意開発を進めています。\n- さらに、先日のゲームジャムで生まれたクオリティの高い多くのプロジェクトについても、NCU に組み込めるかどうかを検討しています。今後ともご注目とご声援をよろしくお願いいたします。\n\n## <b>ゲーム改善</b>\n\n- 偵察報酬を受け取れる状態になると、2周年イベントポップアップに赤いドットが表示されるようになりました。"
    },
    {
      "Header": "v200380",
      "Date": "25.11.2025",
      "Contents": "## <b>無限の塔 オープン</b>\n\n- <b>無限の塔は、多様な条件とチャレンジを導入し、幅広い体験を提供するために設計されたコンテンツです。今回のオープンはその第一歩であり、今後もさまざまな改善を行っていく予定です。皆さまからのご意見・ご提案を心よりお待ちしております。</b>\n- 無限の塔は、<b>毎月1回リセット</b>されるチャレンジ型コンテンツです。\n- 無限の塔でのみ入手できる<b>限定報酬</b>があります。\n    - 今シーズンは、<b>51階をクリアすると神話級コスチューム</b>を獲得できます。\n- 各階には<b>固有の入場条件</b>と<b>特殊バフ</b>があり、それらを克服して戦闘に勝利する必要があります。\n- チケットは<b>12時間ごとにチャージ</b>されます。\n    - Previewnet バージョンでは、パトロール報酬でサファイアダストが獲得できるため、より多く挑戦できます。\n- 初期は<b>最大100階まで</b>開放され、シーズン中に一定数のプレイヤーが最上階に到達すると、<b>次のシーズンで新たな階層が追加</b>されます。\n\n## <b>2周年記念イベント オープン</b>\n\n- <b>2周年記念イベントダンジョン</b>がオープンしました。\n    - <b>APポーション、ダスト、ハンマーなどの全報酬</b>を100%獲得できます。\n    - イベント素材を使用して<b>2周年記念グリモアとオーラ</b>を製作できます。\n- <b>2周年記念 神話級コスチュームと称号</b>獲得可能\n    - これらのアイテムは<b>イベント期間中のみ追加バフ</b>を受け、終了後は元のステータスに戻ります。\n    - <b>合成素材として使用不可</b>、合成結果からの入手も不可です。\n- <b>無料ルーンスロット2個追加</b>\n    - スキルルーンスロット1個、ステータスルーンスロット1個が無料で開放されます。\n    - より多様なビルドをお楽しみください。\n\n## <b>新規コスチューム追加</b>\n\n- <b>2025年秋チャンピオンシップ優勝者コスチューム2種</b>追加\n    - <b>2025年夏チャンピオンシップ優勝者コスチューム2種</b>は、召喚および合成では入手できなくなりました。\n    - 秋優勝者コスチュームは、<b>冬優勝者コスチュームが登場するまでの期間限定</b>で入手可能です。\n- 新コスチューム2種：<b>アバター・オブ・インフィニティ</b>、<b>アバター・オブ・ディフェンス</b>\n    - <b>アバター・オブ・インフィニティ</b>は<b>無限の塔限定報酬</b>です。\n    - <b>アバター・オブ・ディフェンス</b>は<b>コスチューム召喚</b>で入手できます。\n\n## <b>シーズンプラネット – トール再オープン</b>\n\n- 今回のシーズンプラネットは <b>2025年11月25日〜2026年1月29日（木）</b> の期間実施されます。\n- 詳細は明日のローンチ後、Medium にて公開予定です。\n\n## <b>ポータルショップ オープン</b>\n\n- Nine Chronicles ポータルサイトの <b>Play セクションにマーケット機能</b>が追加されます。\n- これにより、従来モバイルでのみ購入可能だった<b>全パッケージをPCでも購入</b>できるようになります。\n- サービス安定性とミッション悪用防止のため、<b>レベル300以上</b>のユーザーのみ利用可能です。\n\n## <b>ゲーム改善</b>\n\n- <b>新規神話級コスチューム4種追加</b>\n    - <b>2025年秋チャンピオンシップ優勝者コスチューム2種</b>\n        - <b>2025年夏優勝者コスチューム2種</b>は召喚・合成では入手不可\n    - <b>無限の塔限定コスチューム1種</b>\n    - <b>コスチューム召喚限定コスチューム1種</b>\n- <b>新規コレクション20種追加</b>\n    - <b>装備関連9種</b>（2周年記念）\n    - <b>素材関連10種</b>\n    - <b>シーズンパスコレクション1種</b>"
    },
    {
      "Header": "v200370",
      "Date": "23.10.2025",
      "Contents": "<b>カスタム装備のバランス調整</b>\n\n- <b>製作コストの調整</b>\n    - 各段階で必要な素材量とブロック数が、従来より<b>2〜4倍減少</b>しました。\n- <b>装備CPバランスの調整</b>\n    - 既存の神聖グレード装備の基礎バランスを、神聖〜神話グレード装備の水準に調整しました。\n    - 段階によっては<b>4〜18倍上昇</b>しています。\n\n<b>ワールドボスのバランス調整</b>\n\n- 最終 <b>WAVEボスのステータスが上方修正</b>されました。\n- <b>貢献度報酬の増加</b>\n    - クリスタル：従来の<b>2倍</b>\n    - ゴールデンダスト：従来の<b>4倍</b>\n\n<b>ルーンバランスの調整</b>\n\n- <b>神話グレードルーンの上方修正</b>\n\n<b>モバイルショップ マイレージ2倍イベント</b>\n\n- <b>10月23日のメンテナンス後</b>より、<b>モバイルショップ</b>での購入時に獲得できるマイレージが<b>2倍</b>になります。\n    - <b>シーズンパス</b>の場合、<b>11月シーズン</b>から適用されます。\n\n<b>神話グレード称号の追加</b>\n\n- 新しい<b>神話グレード称号</b>が追加され、<b>モバイルショップのマイレージストア</b>で購入可能です。\n\n<b>新しいコレクションの追加</b>\n\n- 新しく更新されたアイテムと、既存の<b>神話グレード装備</b>に関連するコレクションが追加されました。\n\n<b>不具合修正</b>\n\n- バナーが正常に読み込まれず、<b>白く表示される問題を修正</b>しました。"
    }
  ]
}