{
    "NoticeData": [
        {
            "Header": "v200210",
            "Date": "30.07.2024",
            "Contents": "<b>アイテムアップグレードにハンマー使用システムを追加</b>\n\n- アイテムアップグレード時にアドベンチャーボスで取得したハンマーを使用して経験値を追加できるシステムが追加されました。\n- ハンマーは武器、鎧、ベルト、ネックレス、指輪の強化に使用できます。\n\n<b>8月イベント</b>\n\n- 8月の1ヶ月間開催されるイベントダンジョン『シトラスカーニバル』がオープンされます。\n- このダンジョンではゴールデンダスト、イベント専用の食べ物、イベント用メダルを入手できます。\n- 詳細な説明はMediumで案内される予定です。\n\n<b>8月シーズンパス</b>\n\n- バウンティハンターの称号を獲得できるシーズンパス9が準備されました。\n- 既存のシーズンパスよりも多くの報酬を提供するシーズンパス9を通じて、アドベンチャーボスからより多くの報酬を獲得してください。\n\n<b>ゲーム改善</b>\n\n- インベントリ改善\n    - 強化時の材料選択部分の並び順を実使用に合わせて改善しました。\n        - 材料タブの上部にAPポーション、砂時計、ダスト類に続いてハンマーがすぐに確認できるように並び順を変更しました。\n        - 基本的に1次並びは希少度の降順で行い、同じ希少度ではCPの降順で表示されます。\n- アドベンチャーボス改善\n    - シーズン進行および次のシーズン待機時に前シーズンの要約情報を表示する機能が追加されました。\n    - 自分の情報に貢献度の%をすぐに確認できるように表示機能が追加されました。\n\n<b>バグ修正</b>\n\n- ワールドボスプレイ中に無限ローディングになる現象を改善\n- 点検およびアップデート案内バックアップのキーバックアップ機能が正常動作しない現象を改善\n- グラインディングを連続で試みると取得クリスタルの数量が正常に表示されない現象を改善"
        },
        {
            "Header": "v200200",
            "Date": "09.07.2024",
            "Contents": "<b>アドベンチャーボスシステムの追加</b>\n\n- アドベンチャーボスシステムが追加されました。\n    - プレイヤーはNCGを使って運営ユーザーになり、ゴールデン、ルビー、エメラルドダストや新しいクリティカルルーンストーンを報酬として受け取ることができます。\n    - APポーションを使って討伐に参加し、ハンマーやNCG、ダスト、新しいルーンストーンを報酬として受け取ることができます。\n        - 参加したプレイヤーの中からランダムで1人に、運営額の5%に相当するNCGが報酬として与えられます。\n        - 参加したプレイヤーは、貢献度に応じて運営額の15%に相当するNCGを分け合います。\n    - アドベンチャーボスのオープンタイミングは、プレイヤーの分散型の参加によって決定され、オープン後4時間以内にボスを倒す必要があります。一度シーズンが終了すると、10800ブロック後に再オープンが可能です。\n- アドベンチャーボスシステムの詳細については、以下の記事をご確認ください。\n    - [Introducing Adventure Boss](https://medium.com/nine-chronicles/9cm-introducing-adventure-boss-eda4712cd2e2)\n\n<b>グリモア装備と召喚システムの追加</b>\n\n- エメラルドダストを使用して召喚可能なグリモア装備が追加されました。\n    - 召喚で取得した装備は、基本的に取引不可属性を持ちます。\n    - 今回追加されたグリモア装備は、3つのスキルタイプ、4つのグレード、3つのサブステータスで構成された合計36種類の装備が追加されました。\n- グリモア装備は、新たに追加されたグリモア装備スロットに装着できます。\n- エメラルドダストは、アドベンチャーボスシステムの運営報酬および討伐報酬として取得可能です。\n\n<b>ゲーム改善</b>\n\n- 装備制作のバランス変更\n    - エピック、ユニーク、レジェンダリー、聖級の装備制作体験が大幅に改善されました。\n        - プレミアムレシピの制作コストが大幅に軽減されました。\n            - 制作に必要な材料量と制作時に発生する待機ブロックが大幅に減少しました。\n        - 装備にスキルが付与される確率が大幅に増加しました。\n        - レシピ解除に必要なクリスタルが大幅に減少しました。\n    - ノーマル、レア、エピック、ユニーク級装備の強化に必要なNCGが50%減少しました。\n- ステージバランスの変更\n    - ワールド6、7、8のモンスターのステータスが大幅に減少しました。\n- ワールドボスランキング計算方法の変更\n    - ランキング方式の一貫した体験を確保するために、ワールドボスのランキング計算方法がアリーナスタイルに変更され、同点の場合は下位にランクされるようになりました。\n    - 現在、Sランクで同点者が多数発生し、ランキングの差別化が不足している問題は、今四半期にコミュニティと協力して修正していく予定です。\n- 11種類の新コレクションの追加\n    - 新たに導入されたエメラルドダストと6月シーズンパス称号に関連するコレクションが追加されました。"
        },
        {
            "Header": "v200190",
            "Date": "01.07.2024",
            "Contents": "<b>ゲーム改善</b>\n\n- libplanetのアップデートにより、ブロック生成時間が安定化される予定です。\n- 食品使用のUX改善：\n    - インベントリでは、同じIDを持つ食品を個別に表示せず、数量を表示することで、より簡単に使用および確認できるように改善しました。\n    - PCバージョンのショップでは、同じIDの食品を一度に複数登録できるようにUXを改善しました。"
        }
    ]
}