{
    "NoticeData": [
        {
            "Header": "v200160",
            "Date": "27.03.2024",
            "Contents": "<b>新しいワールド8が追加されました</b>\n\n- 新しいワールド8、HELHEIMが開放されました！\n    - 351-400、50ステージが追加されました。\n- 新しいグレード、神聖クラス装備が追加されました！\n    - 武器、鎧、ベルト、ネックレス、指輪の各タイプに5種類ずつ、合計25種類の装備を製作できるレシピが追加されました。\n- 新しい食品6種が追加されました！\n    - これら6種類の食品を製作できるレシピが追加されました。\n- 最大500レベルまでのレベルデータが追加されました。\n\n<b>コレクションシステムの改善</b>\n\n- コレクションシステムに便利機能が追加されました。\n    - コレクションに必要な材料を入手できるショートカット機能が追加されました。\n    - コレクションリストのソート機能が改善されました。\n        - 即時完成可能、一部条件達成、条件未進行の順にソートされます。\n    - 製作メニューからコレクションメニューへのショートカット機能が追加されました。\n    - ステージ、アリーナ、ワールドボス戦の準備画面で、コレクションで獲得したステータスを確認できます。\n\n<b>インゲームモンスターコレクションの改善</b>\n\n- モンスターコレクション報酬受取時のアイテム確認演出が追加されました。\n- メインロビーでモンスターコレクションの進行関連情報を表示するようになりました。\n    - レベルと報酬受取までの残り時間を表示します。\n- マイグレーション機能が追加されました\n    - 報酬が更新された場合、マイグレーションを行い、新しい報酬で契約を更新できます。\n\n<b>4月イベント</b>\n\n- ワールド8更新を記念したバランス調整が行われます。\n    - ワールド1-7での装備製作に必要なブロックおよび材料の数量が変更されました。\n\n<b>ゲーム改善</b>\n\n- コレクションリストが拡張され、一部の報酬バランスが調整されました。\n- ワールドボスのSKIP機能が全戦闘をスキップするように変更されました。\n- イベントダンジョンの最終ステージクリア後に、再挑戦ボタンが追加されました。\n- ステージ進行時のSWEEP機能で使用できるAPポーションの最大量が10から20に増加しました。\n- ステージ進行時のREPEAT機能で、APポーションを1本使用できるようになりました。\n- 伝説グレードの材料で装備を製作する際のクリスタル代替コストが33%減少しました。"
        },
        {
            "Header": "v200150",
            "Date": "28.02.2024",
            "Contents": "<b>コレクションシステムアップデート</b>\n\n- プレイヤーが装備、食料、衣装、称号、材料を集めてStatを獲得できるコレクションシステムが追加されました。\n- このシステムを通じて得られるStatには、既存の+Statと、今回初めて追加される%Statの2種類があります。\n    - %Statは、全ての+Statを合算した後に、既存のスキルバフと組み合わせて百分率で計算されます。\n    - CDMGはクリティカルダメージの略で、クリティカルヒット時に追加で与えられるダメージを増加させるStatです。\n\n<b>モンスターコレクションのゲーム内での開始、変更、報酬獲得機能追加</b>\n\n- モンスターコレクションの開始、数量変更、報酬受取の機能が、以前はPC版ランチャーを通じてのみ可能でしたが、ゲーム内で利用できるようになりました。\n- その結果、PC版を使用しないユーザーもモンスターコレクションを通じて様々な報酬を受け取ることができます。\n\n<b>モンスターコレクションにルビーダスト報酬追加</b>\n\n- コレクションで使用されるルビーダストが、モンスターコレクションの報酬として追加されました。\n- 今後、この素材アイテムの様々な用途を提供する予定です。\n\n<b>SPD関連戦闘処理変更</b>\n\n- プレイヤーが所有するStatの表示が、小数点を使用しないように変更されました。\n- アリーナ、ワールドボス、ステージでのスキル使用後の速度処理が、以前は攻撃と同様に扱われていましたが、変更されました。現在は、スキルを使用した場合、SPD値が0.6ではなく0.9に乗算して再計算されます。これらの変更で、スキルを使用直後のターンを取る確率が大幅に高まりました。\n- この変更は、スキル使用のコストを減らし、スキル装備の価値を高め、今後の戦闘戦略の多様性をスキル使用で強調することを目的としています。\n\n<b>バグ修正</b>\n\n- ワールドボスシーズン開始時にメインロビーでアナウンス画像が表示されない問題を修正しました。\n- アリーナでアバターのレベル表示問題を修正しました。"
        },
        {
            "Header": "v200140",
            "Date": "19.02.2024",
            "Contents": "<b>Libplanet アップデート</b>\n\n- 活動を処理するシステムの速度向上。\n- データ構造の最適化。"
        }
    ]
}