{
    "NoticeData": [
        {
            "Header":"[Patch Note] v200070",
            "Date":"01.09.2023",
            "Contents":"<b>[Improvement]</b>\n\nImprovement of the Equipment Item Upgrade Method\nEach Equipment Item has an initial experience based on its grade and crafting cost.\nReinforcing the same kind of items with materials increases the experience value.\nIf the experience value is higher than the value for a particular level, it becomes that level.\nItems of the same class and type have the same experience required to raise the level.\nAs the level goes up, the stat number that increases is the same as before.\nUpgrades beyond level 4 consume the same NCG regardless of grade.\nExisting reinforced items are calculated to have the required experience to achieve the same level of reinforcement.\nWe will explain the details through the community soon.\n\nEquipment Item Craft UI improvement\nMove to the top of the equipment category tab position\nShow in the list of items where the recipe does not exist X\nAdd a condition to display the recipe and change the order of display according to the condition\n<b>[Bugfix]</b>\n\nFixed a bug where the opponent's rune level was treated the same as my rune level when fighting an opponent wearing a rune in Arena Battle\n"
        },
        {
            "Header":"[Patch Note] v200063",
            "Date":"29.08.2023",
            "Contents":"<b>[Bugfix]</b>\n\n- Fix a bug where Crystal type was incorrectly defined in Monster Collection's reward.\n    - This bug is a fix for a future bug that has not yet been reproduced in a claim on the mainnet."   
        },
        {
            "Header":"[Patch Note] v200061",
            "Date":"23.08.2023",
            "Contents":"<b>[Bugfix]</b>\n\n- Fixed an issue where monster collection reward quantity was calculated incorrectly."
        },
        {
            "Header":"[Patch Note] v200060",
            "Date":"22.08.2023",
            "Contents":"<b>[Improvement]</b>\n\n- Change NCG Staking - Monster Collection - rewards\n    - Change the AP potions and hourglasses compensation of levels 5, 6, and 7 to higher than before. Add crystals to the regular rewards you get each week at levels 2,3,4,5,6,7.\n    - There is an update in the Monster Collection section of Launcher and 9c player.We will introduce the detailed information through medium.\n- Adding a loading progress bar UI."
        },
        {
            "Header":"[Patch Note] v200050",
            "Date":"07.08.2023",
            "Contents":"<b>[Improvement]</b>\n\n- <b>Improved display of remaining blocks</b>\n    - Mark the block and time together on the part where only the block was displayed before.\n    - Block 1 is being calculated on a 12-second basis, and it will be improved on areas where the area does not proceed stably due to issues such as improvement of action time.\n- Modified minimum font size.We have improved the problem that was not visible because the font was too small.\n\n<b>[Bugfix]</b>\n\n- Fixed an issue where the screen ratio was unevenly displayed at a certain resolution.\n- Fixed an issue where launcher language settings were forced into English(en)\n- Fixed an issue where the tip phrase went out of the screen on the loading screen"
        },
        {
            "Header":"[Patch Note] v200040",
            "Date":"20.07.2023",
            "Contents":"<b>[Feature]</b>\n\nNine Chronicles Mobile, a first step towards improvement, is launching on specific local google play stores.\n\nA service enable Mobile In-App Purchase, NineChronicles.IAP, will be launching.\nMore details are available on [NCIP-16](https://github.com/planetarium/NCIPs/blob/main/NCIP/ncip-16.md).\n\n<b>[Improvement]</b>\n\nChange initial payment crystal quantity when creating new Avatar\n\nWorld 1 to 3 stage balance and some equipment options change\n\nImproving the level of wearing user equipment (adjusted 1 to 30 LV lower than before)\n\nImproved pet effect (2 to 5 times)\n\nImproved HAS action speed\n\n<b>[Bugfix]</b>\n\nModified compensation calculation logic for action 'claim_stake_reward'."
        },
        {
            "Header":"[Patch Note] v200030",
            "Date":"29.06.2023",
            "Contents":"<b>[Improvement]</b>\n\n<b>Technical Changes</b>\n\n- The mainnet will introduce \"Mead\" as a form of commission and a contract concept called \"Pledge\" to supply it.\n    - Activation codes are being removed.\n    - <b>Introduction of MEAD</b>\n        - Activation flow through the portal-launcher will be altered.\n        - Changes in the entry flow for existing users from the portal/launcher.\n            - Existing users without a valid contract will enter the Migration flow.\n        - Users without a valid contract (Pledge) will display a General error in the client (Tx creation not possible)\n        - For more detail, you can check [NCIP-15](https://github.com/planetarium/NCIPs/blob/a8cf79372c35364aef5e0c8af878d65f6dbac74c/NCIP/ncip-15.md)\n- <b>The upgrade failure rate for all equipment enhancements will be removed.</b>\n    - The upgrade failure rate will be included in the success rate.\n    - The chance of great success will remain unchanged.\n- <b>Championship 4 Reward Costumes and Titles will be added</b>\n    - Costume : Dark Enchantress Lamia - HP 8550\n    - Title : Championship 4 Ranker - ATK 500\n- <b>The Avatar Creation (Hair, Ears, Tail Combination) UI will be updated.</b>\n- <b>GARAGE tokens will be added to the level 7 Monster Collection rewards</b>\n- <b>Mimisbrunnr has removed.</b>\n    - Mimir stage UI and craft will be removed.\n    - The required level for equipping Mimir equipment will become the same as Basic equipment.\n    - Players can use the previously manufactured Mimir equipment as before.\n- <b>Craft list revisions</b>\n    - UI emphasizing premium craft will be added.\n\n<b>[Bugfix]</b>\n\n- The bug causing over-distribution of Monster Collection Runes has been corrected.\n- The bug causing different arena results to be displayed has been corrected."
        }
    ]
}
