{
    "NoticeData": [
        {
            "Header": "v200180",
            "Date": "07.06.2024",
            "Contents": "<b>ルビー召喚アップデート</b>\n\n- ルビーダストを使用したルビーオーラ、ルビールーン召喚が追加されました。\n- 既存のゴールデンダストルーン召喚と似ていますが、ルーンの召喚確率が異なります。欲しかったルーンの確率が上がったかどうかを確認してください！\n- 召喚の構成および確率の詳細は、ワークショップ - 召喚で確認できます。\n\n<b>新オーラ3種 & ルーン2種追加</b>\n\n- 神聖等級を含むイミルオーラが追加されました。\n    - イミルオーラはユニーク、レジェンダリー、神聖の3種類の等級で取得可能です。\n    - イミルオーラはワークショップ - 召喚メニューのゴールデンオーラおよびルビーオーラ召喚で取得できます。\n- 神聖等級オーディンルーン2種が追加されました。\n    - これらのルーンを含む、今後登場する神聖等級のルーンの破片は譲渡不可属性を持つ予定です。\n    - これらのルーンはワークショップ - 召喚メニューのゴールデンルーンおよびルビールーン召喚で取得できます。\n\n<b>6月イベント</b>\n\n- 偵察報酬の報酬品目にゴールデンダストとAPポーションが追加されます。\n- 新しい装備の制作に必要な待機ブロックが30%減少されます。\n- レベル250以上のプレイヤーにゴールデンダストが支給されます。\n\n<b>ルビーガーディアンパスアップデート</b>\n\n- ルビーガーディアンの称号を取得できるルビーガーディアンパスが発売されました。\n- ルビーガーディアンの称号は、HP 63114、SPD 20872の優れたステータスを付与します。\n\n<b>ゲーム改善</b>\n\n- 一部のコレクションの報酬が上方修正されました。\n- 新しいコレクションが追加されました。\n- ワークショップ - 召喚 - 一般セクションのノーマルオーラ召喚に、レア、エピック、ユニーク等級のオーラが追加されました。\n- ゲーム開始画面に、所持しているQR形のキーをインポートできる機能が追加されました。\n\n<b>バグ修正</b>\n\n- ワールドボスの進行後、アニメーションの再生速度が遅くなるバグが修正されました。\n- オーディンチェーンの一部のユーザーに8番目のワールドクエストが表示されないバグが修正されました。"
        },
        {
            "Header": "v200170",
            "Date": "30.04.2024",
            "Contents": "<b>ルーンレベルボーナスシステムアップデート</b>\n\n- 装備しているルーンの全レベルの合計に基づいたステータスボーナスを適用するルーンレベルボーナスシステムが更新されました。\n- ボーナスは最低30％から最大1000％まで！ ルーンのレベルアップには絶好の機会です。\n- 詳細はMediumを通じて提供されます。\n\n<b>マルチレベルルーンアップグレード機能更新</b>\n\n- 一度に最大30のルーンレベルまでレベルアップ可能になりました！\n- すべてのルーン強化の成功率が100％に変更されました！\n- 以前80％未満だったレベルのアップグレードコストが100％基準に合わせて調整されました。\n\n<b>新しいルーンの追加</b>\n\n- 2つの新しい神聖級ルーンが追加されました：\n    - 1つのスキルルーンと1つのステータスルーンで、詳細仕様はMediumで確認できます。\n    - これらのルーンを含む今後の神聖級ルーンストーンは非売品です。\n- これらのルーンはワークショップ - サモン - ゴールデンルーンサモンを通じて入手可能です。\n\n<b>5月イベント</b>\n\n- ルーンレベルボーナスアップデート記念イベント\n    - 5月を通じて、世界のボスであるオーディンとヘイムダルが休みなく続きます。\n    - 世界ボスバトル報酬とルーンストーンのグレード報酬が1.5倍に増加します。\n- クリスタル装備素材ドロップイベント\n    - イベント期間中、ステージ150、200、250、および300は通常の素材の代わりにクリスタル装備素材をドロップします。\n    - これらの素材を使用してクリスタル装備を作成し、クリスタルを獲得すると、今後の冒険に大いに役立ちます。\n    - クリスタル装備に関する確率と説明はMediumで確認できます。\n\n<b>シーズンパス ルーンマスター（2024年5月）更新</b>\n\n- ルーンマスターの称号を獲得できるシーズンパスが更新されました。\n    - ルーンマスターの称号は冒険ミッションでの優れたサポートを提供するように設計されています。\n- プレミアムパスユーザーには、新シーズンが始まった後1週間、前シーズンの未受取報酬を受け取る新機能があります。\n\n<b>ゲーム改善</b>\n\n- 8つ目の世界への進入を支援するために、ステージ151から359までのステージリバランスが行われました。\n- 8つ目の世界の装備の強化に必要なブロック数を減少させる調整が行われました。\n- 一部の8つ目の世界のリング装備の防御ステータスが誤って設定されていたため、修正が行われました。\n- 一部のコレクションがアップグレードされ、新しいコレクションが追加されました。\n- モバイルのスタート画面でアカウント情報を含むキーファイルのバックアップ機能が追加されました。\n- 装備のツールチップには、その装備が持っている経験値が表示されるようになりました。\n- 製作前に、装備のレシピは初期に持つ経験値を表示します。\n- レシピセクションには、関連するコレクションの数と成就数が表示されます。\n- 装備のグラインディングからのクリスタル取得計算が変更されました。\n    - 強化が5回まで増加し、その後、5回の強化と同じ量が与えられます。\n    - 装備1つあたりの純粋な取得上限は1億クリスタルであり、ステーキングボーナスを除外します。\n\n<b>バグ修正</b>\n\n- アリーナチケット情報が使用後に正しく更新されていない問題を修正しました。\n- アリーナリストの個人情報が正しく更新されていない問題を修正しました。\n- ステージ進行中の実際の結果とシミュレーションが異なる問題を修正しました。"
        },
        {
            "Header": "v200160",
            "Date": "27.03.2024",
            "Contents": "<b>新しいワールド8が追加されました</b>\n\n- 新しいワールド8、HELHEIMが開放されました！\n    - 351-400、50ステージが追加されました。\n- 新しいグレード、神聖クラス装備が追加されました！\n    - 武器、鎧、ベルト、ネックレス、指輪の各タイプに5種類ずつ、合計25種類の装備を製作できるレシピが追加されました。\n- 新しい食品6種が追加されました！\n    - これら6種類の食品を製作できるレシピが追加されました。\n- 最大500レベルまでのレベルデータが追加されました。\n\n<b>コレクションシステムの改善</b>\n\n- コレクションシステムに便利機能が追加されました。\n    - コレクションに必要な材料を入手できるショートカット機能が追加されました。\n    - コレクションリストのソート機能が改善されました。\n        - 即時完成可能、一部条件達成、条件未進行の順にソートされます。\n    - 製作メニューからコレクションメニューへのショートカット機能が追加されました。\n    - ステージ、アリーナ、ワールドボス戦の準備画面で、コレクションで獲得したステータスを確認できます。\n\n<b>インゲームモンスターコレクションの改善</b>\n\n- モンスターコレクション報酬受取時のアイテム確認演出が追加されました。\n- メインロビーでモンスターコレクションの進行関連情報を表示するようになりました。\n    - レベルと報酬受取までの残り時間を表示します。\n- マイグレーション機能が追加されました\n    - 報酬が更新された場合、マイグレーションを行い、新しい報酬で契約を更新できます。\n\n<b>4月イベント</b>\n\n- ワールド8更新を記念したバランス調整が行われます。\n    - ワールド1-7での装備製作に必要なブロックおよび材料の数量が変更されました。\n\n<b>ゲーム改善</b>\n\n- コレクションリストが拡張され、一部の報酬バランスが調整されました。\n- ワールドボスのSKIP機能が全戦闘をスキップするように変更されました。\n- イベントダンジョンの最終ステージクリア後に、再挑戦ボタンが追加されました。\n- ステージ進行時のSWEEP機能で使用できるAPポーションの最大量が10から20に増加しました。\n- ステージ進行時のREPEAT機能で、APポーションを1本使用できるようになりました。\n- 伝説グレードの材料で装備を製作する際のクリスタル代替コストが33%減少しました。"
        }
    ]
}