{
    "NoticeData": [
        {
            "Header": "v200280",
            "Date": "14.2.2025",
            "Contents": "<b>Arena Rule Changes</b>\n\n- <b>Ticket Refill Count</b>:\n    - Each refill (initial and subsequent) grants <b>5 tickets</b>.\n    - There are <b>20 ticket distributions per season</b>, allowing a total of <b>100 basic tickets</b>.\n    - Additional ticket purchases limited to 24 <b>tickets</b> (4 per interval).\n    - <b>Purchase Prices</b>:\n        - <b>Season</b>: Starts at 1, increases by 0.2 per purchase.\n        - <b>Championship</b>: Starts at 2, increases by 0.2 per purchase.\n        - Up to 4 tickets can be purchased at once; unused tickets reset when the interval changes.\n- <b>Service Stability Note</b>:\n    - During the last 10 blocks of each interval, refreshing the opponent list and conducting arena battles using tickets will be unavailable.\n    - Additionally, ticket purchases will be unavailable during the last 40 blocks.\n- <b>Score and Ranking Updates</b>:\n    - Updates occur at the start of each ticket refill interval.\n    - Battle scores and win/loss stats are displayed in the UI and reset at the beginning of the next interval.\n- <b>Opponent List Updates</b>:\n    - At each ticket refill interval, 5 fixed opponents are displayed based on rank groups:\n        \n        \n        | Group | Range (%) | Win Score | Loss Score |\n        | --- | --- | --- | --- |\n        | 1st | Top 0–5% | +22 | -1 |\n        | 2nd | Top 5–20% | +21 | -2 |\n        | 3rd | Top 20–60% | +20 | -3 |\n        | 4th | Top 60–80% | +18 | -4 |\n        | 5th | Top 80–100% | +16 | -5 |\n        - Opponents are chosen randomly from these groups.\n        - If you are targeted and defeated by an opponent during the interval, your rating will decrease by 1.\n        - <b>Opponent refresh:</b>\n            - Up to 7 refreshes per round.\n        - <b>Refresh Cost</b>\n            - First 3 refreshes are free; the following 4 are paid.\n            - The paid refresh cost starts at 0.5 NCG and increases by 0.5 NCG with each use.\n    - Battles cost <b>5 AP per action</b>.\n    - Ingredients previously awarded as Arena rewards are now obtainable from specific stages in each world.\n\n<b>Battle and Score Processing Updates</b>\n\n- <b>Opponent List & Scoring</b>:\n    - Now processed through dedicated external services rather than on-chain contracts.\n- <b>Event Management</b>:\n    - Event organizers (other than Planetarium) can customize rules such as scoring and ranking.\n- <b>On-Chain Records</b>:\n    - The blockchain will log and return battle results processed via external services.\n\n<b>Clan Battle Feature</b>\n\n- <b>Clan Scoring</b>:\n    - Clan scores are calculated by summing the top 10 players’ scores within the clan.\n- <b>Rewards</b>:\n    - Clan rankings determine seasonal rewards.\n- <b>Testing Phase</b>:\n    - Clan data will first be tested on <b>Thor</b>. After testing, clan-related features will be rolled out across all chains.\n\n<b>Game Improvements</b>\n\n<b>Planned Features</b>\n\n- <b>Inventory Sorting in the PC Version Shop</b>:\n    - Items are now grouped by type and sorted by CP (Combat Power).\n- <b>Mobile Version - Planet Access Notification</b>:\n    - If planet data cannot be retrieved, a message will inform users that access is temporarily restricted and to try again later.\n- <b>NCG Refund Button Adjustment in Staking Popup</b>:\n    - The NCG refund claim button, previously available only in the amount change flow, is now directly visible in the main popup.\n\n<b>Bug Fixes</b>\n\n- <b>Resolved an issue where adding a new synthesis material removed previously registered materials.</b>"
        },
        {
            "Header": "v200270",
            "Date": "27.01.2025",
            "Contents":"<b>NCG Claim Feature Addition and Stake Amount Adjustment Process Update</b>\n\n- NCG Claim Distribution:\n    - NCG used across each chain will now be distributed to staking users at a fixed percentage every block.\n    - The total distributed amount will be divided proportionally based on the total staked NCG amount.\n    - Once the accumulated amount exceeds a certain threshold, users will be able to claim their rewards.\n- Stake Adjustment Policy Update:\n    - The previous 4-week lockup period required to decrease staked amounts has been removed.\n    - However, if the staked NCG amount is reduced, the excess amount will only be refunded after 75,600 blocks (approximately one week) from the adjustment block.\n        - While the reduced NCG is being processed for return, additional reduction requests cannot be made.\n    - This adjustment is part of the Proof-of-Stake (PoS) policy, and further detailed explanations will be provided in upcoming announcements.\n\n---\n\n<b>Costume Summoning and Synthesis Features Added</b>\n\n- In response to the overall enhancement of equipment and rune balance, the stats of all previously distributed costumes have been adjusted upward.\n- Additionally, a summoning feature has been added for 22 of the newly adjusted costumes, allowing players to acquire them through summons.\n- Costumes obtained via summoning can also be acquired through synthesis.\n\n---\n\n<b>Game Improvement</b>\n\n- Patrol reward stabilization\n- Improvement of event dungeon ticket and AP point overlap issue\n- Added feature to prioritize sellable items in the PC shop 'Sell' section\n- Added planet name to push notifications in the mobile client\n- Improved mobile client to display only accessible planets when some planets are unavailable"
        },
        {
            "Header": "v200260",
            "Date": "20.12.2024",
            "Contents": "<b>Synthesis System Added</b>\n\n- <b>New Feature</b>: The new synthesis system allows you to combine multiple lower-rarity pieces of equipment to potentially create a single piece of higher-rarity equipment.\n- <b>Applicable Equipment</b>: <b>Aura</b> and <b>Grimoire</b> gear.\n- <b>How It Works</b>:\n    - Select multiple lower-rarity items as materials.\n    - Initiate a synthesis attempt to produce a higher-rarity item.\n    - On success, you receive an item of the next rarity tier. On failure, you obtain an item of the same rarity tier as the materials used.\nFor more detailed instructions and specifics, please refer to [NCIP-23](https://github.com/planetarium/NCIPs/blob/ncip-23/NCIP/ncip-23.md).\n\n<b>3 New Sacred Auras Added</b>\n\n- <b>Aegis</b>, <b>Barrage</b>, and <b>Beast</b> Sacred-Grade Auras have been introduced.\n- They can be obtained through <b>Golden Dust Summons</b> and <b>Ruby Dust Summons</b> in the Aura Summons menu.\n\n<b>Ragnarok Collaboration Event Dungeon Added</b>\n\n- <b>Event Duration</b>: From <b>December 20, 2024, 5:00 AM (UTC)</b> to <b>January 10, 2025, 5:00 AM (UTC)</b>\n- <b>Unique Event Food</b>: Provides boosts comparable to items found in Worlds 7–8.\n- <b>Abundant EXP</b>: Earn <b>11 EXP per stage</b> for rapid leveling.\n- <b>Generous Rewards</b>: Obtain Golden Dust, hammers, hourglasses, and exclusive crafting materials.\n\n<b>Mobile Mileage Integration</b>\n\n- Mileage earned from Odin, Heimdall, and Thor Planets has now been consolidated.\n- This unified mileage will accumulate when purchasing items from the mobile shop on any planet.\n- Unified mileage can be spent across all planets, except for Thor.\n\n<b>New Items Added to Mileage Shop</b>\n\n- <b>1 Costume</b> and <b>1 Title</b> added to the Mileage Shop.\n- <b>1 Golden Thor Rune</b> and <b>1 Golden Meat</b> items added to the Mileage Shop.\n\n<b>Game Improvements</b>\n\n- <b>Rune Equipment Fix</b>: Resolved an issue that prevented proper rune equipping when non-owned runes were erroneously equipped."
        }
    ]
}