{
  "NoticeData": [
    {
      "Header": "v200410",
      "Date": "24.02.2026",
      "Contents": "## Patrol Reward Event\n\n<b>Feb 24, 2026 – Mar 24, 2026 (4 weeks)</b>\n\nDuring the event period, Patrol Rewards will be adjusted so that players can obtain\n\n<b>Golden Dust, Ruby Dust, or Emerald Dust</b> based on their level range,\n\nwith up to <b>2,000+ obtainable</b>.\n\nLog in and claim rewards regularly to experience a variety of summons!\n\n## Transcendent-Grade Summon Equipment Added\n\n<b>▸ 4 New Auras</b>\n- Transcendent Auras: <b>Ymir, Beast, Aegis, Barrage</b>\n\n<b>▸ 9 New Grimoires</b>\n- 3 each in Attack / Defense / Function categories (Total 9)\n\n<b>▸ 2 New Runes</b>\n- Limited-time planet Thor-related Transcendent Runes\n    - Skill Rune: <b>Thor’s Mjölnir Rune</b>\n    - Stat Rune: <b>Ragnarok Rune</b>\n\n<b>▸ 2 New Costumes</b>\n- Championship commemorative Transcendent costumes:\n    - <b>Odin 26 First Champion</b>\n    - <b>Heimdall 26 First Champion</b>\n\n## Transcendent-Grade Adjustments\n\n- <b>Summon Rate Changes</b>\n    - Aura / Grimoire / Rune / Costume summon data updated\n- <b>Synthesis Changes</b>\n    - Aura / Grimoire / Costume synthesis data updated\n    - Mythic costumes <b>SharkBa2</b> and <b>TriplexMazi</b> can no longer be obtained via synthesis\n\n## Game Improvements\n\n- Added new Collections related to Transcendent equipment\n- Added Mythic-grade Hammer"
    },
    {
      "Header": "v200400",
      "Date": "27.01.2026",
      "Contents": "## <b>Game Improvements</b>\n\n- <b>Event Dungeon SWEEP Added</b>\n    - You can now quickly claim rewards from event dungeons by using <b>SWEEP</b> based on the number of tickets you own.\n- <b>Increased Stage SWEEP Max AP Potion Usage</b>\n    - Previous: Max <b>20</b>\n    - Updated: Max <b>100</b> potions\n- <b>Increased Stage REPEAT Max AP Potion Usage</b>\n    - Previous: Max <b>1</b>\n    - Updated: Max <b>5</b> potions\n- <b>Reduced World Boss Repeat Block Interval</b>\n    - Previous: Once every <b>5 blocks</b>\n    - Updated: Once every <b>1 block</b>\n    - At the beginning of the update, the interval was set to ensure a similar experience across all environments due to the lack of animation skip. With this change, faster progression is now possible.\n- <b>Rune Level Cap Adjustment on Initial Unlock</b>\n    - Previously, newly unlocked runes were limited to emphasizing the “open” feature rather than upgrading.\n    - This has been adjusted so that newly unlocked runes can now be leveled up to <b>Level 30</b>, depending on available materials, allowing faster progression.\n- <b>Collection Sorting Improvements</b>\n    - Previous: Displayed in descending order based on the time added\n    - Updated: Collections are now grouped by <b>% reward priority</b>, then sorted by <b>total reward value</b> in descending order\n- <b>21 New Collections Added</b>\n\n## <b>Infinite Tower Season 3 Data Added</b>\n\n- Added content for <b>Infinite Tower Season 3</b>, which will run throughout <b>February</b>\n    - <b>Skill Runes and Auras disabled</b>\n    - Increased the number of conditions applied per floor to provide a more varied experience\n    - <b>Maximum CP significantly increased</b>\n    - Chains with <b>5 or more players reaching Floor 100</b> this season will unlock <b>additional floors in the next season</b>, so we encourage your participation\n\n## <b>2nd Anniversary Event Ended</b>\n\n- <b>2nd Anniversary Event Popup Closed</b>\n    - Patrol rewards have been restored to their original state\n- <b>Thor Event Conclusion</b>\n    - After the currently ongoing World Boss, no further content such as Arena, World Boss, or Infinite Tower is scheduled for Thor.\n    - The period opened to allow players to return <b>staked assets and held NCG</b> to their original chains during February will be closed, so please plan accordingly to avoid any inconvenience.\n\n<b>Bug Fixes</b>\n\n- Fixed an issue where <b>season rewards could not be properly claimed</b> when the <b>Fenrir-type World Boss</b> was active."
    },
    {
      "Header": "v200390",
      "Date": "23.12.2025",
      "Contents": "## <b>Infinite Tower 2nd season</b>\n\n- This season, Aura and Water/Wind attribute equipment cannot be used on any floor.\n- Starting this season, the probability of each condition being selected will be displayed.\n- Starting this season, the conditions selected for each floor will be shown when you enter the floor.\n- The resources required to enter each floor have also been simplified.\n- From next year, we are considering a system where seasonal conditions for the Tower of Infinity will be proposed by the community. We look forward to your ideas and participation.\n\n## <b>25 Last Event Dungeon - Golden Dust Valut Open</b>\n\n- A year-end seasonal event dungeon where you can obtain Golden Dust and Sapphire Dust has been added.\n\n## <b>NCU 2nd Project – Teaser Banner Update</b>\n\n- A new NCU project is on the way — one that both new players on a new platform and long-time Nine Chronicles fans will be able to enjoy together.\n- In this project, you’ll play through content tied to Nine Chronicles’ main story, *Odin’s Conspiracy*. We’re also working hard on features that let you make payments with WNCG in external environments.\n- In addition, we’re carefully reviewing many of the high-quality projects from the recent game jam to see if they can be integrated into NCU. We’d really appreciate your interest and support.\n\n## Game Improvements\n\n- A red dot indicator is now shown on the 2nd Anniversary event popup when Recon rewards are available to claim."
    }
  ]
}