{
    "NoticeData": [
        {
            "Header": "v200240",
            "Date": "29.10.2024",
            "Contents": "<b>World Boss Reward Improvements</b>\n\n- After the end of the World Boss season, rewards based on ranking will now include Golden Dust and AP Potions.\n    - Players who rank from 1 to 100 will receive Golden Dust and AP Potions in addition to the existing Rune Shards and Crystals, based on their ranking group.\n    - Detailed quantities can be checked in the World Boss - Rewards tab in the game.\n- The reward runes for the World Bosses Fenrir and Jerminir will be replaced with new ones.\n    - The old runes can still be obtained through Summon - Rune Summon and can be traded via the shop on the PC version.\n    - The new runes consist of Legendary skill runes and Unique, Epic stat runes.\n    - In the future, we plan to continue replacing reward runes through seasonal updates to maintain the content's value, in collaboration with the community.\n\n<b>World Boss Rune Replacement and First Clear Reward Enhancements</b>\n\n- Three Adventure Boss reward runes have been replaced.\n    - The previous CRI, HIT, and SPD runes have been swapped with HP, ATK, and DEF runes.\n    - HP runes can be obtained as operational rewards, while ATK and DEF runes are acquired as battle rewards.\n    - The existing Rune Shards can still be traded via the shop on the PC version.\n    - We aim to continue maintaining the content's value through seasonal updates and rune replacements in collaboration with the community.\n- Enhanced First Clear Rewards for Adventure Bosses\n    - Rewards for each floor have been changed from HIT and SPD runes to ATK and DEF runes.\n    - The number of hammers rewarded per floor has increased by 50-100%.\n\n<b>New Rune Added to Monster Collection (Thor - Golden Seed Rune)</b>\n\n- A new reward, the Thor - Golden Seed Rune, has been added to Monster Collection.\n    - Available for players with a staking amount of 5,000 or more.\n    - This divine-grade stat rune will be particularly beneficial for those conducting NCG staking.\n- Enhanced Migration Guidance\n    - New rewards have been added, allowing you to obtain the new Rune Shards after migrating Monster Collection.\n    - To address previous instances of insufficient migration guidance, the instructions have been significantly improved.\n    - When migration is possible, a popup will appear in the game's staking menu to guide you through the process.\n        - Upon migration, rewards will be provided according to the latest reward table.\n        - Please note that migration will reset the starting point for calculating reward intervals and contract modification intervals.\n\n<b>Pet Balance Adjustments and Eight New Variation Pets Added</b>\n\n- Pet Balance Adjustments\n    - The performance of four existing pets (Black Cat, Red Donguri, Valkyrie, Little Fenrir) has been improved.\n    - Depending on the pet's type and level, their abilities have been enhanced by 20-80%.\n\n- Eight New Pets Added\n    - Eight new pets with appearances similar to existing pets have been added.\n    - With the upgrade from 4 to 8 crafting slots, we hope you enjoy crafting with a variety of pets.\n    - The UI for using pets during crafting has been updated to accommodate the new additions.\n    - The new pets can be unlocked and enhanced using the same soul stones as existing pets.\n\n<b>Collection Balance Adjustments and New Additions</b>\n\n- To enhance the value of the collection system, new collections with lower entry barriers (such as 0 enhancement equipment, summons, and new foods) have been added, along with improved rewards for existing collections.\n- 73 New Collections Added\n    - 35 new collections for zero-enhancement equipment (without skills) from Worlds 1-7 have been added.\n    - 36 new collections for Grimoire equipment have been added.\n    - 2 new collections for Golden Steak food have been added.\n- Balance Adjustments for 44 Existing Collections\n    - Rewards for 35 collections for zero-enhancement equipment (with skills) from Worlds 1-7 have been significantly increased.\n    - Rewards for 9 collections for AP Potions, Hourglasses, and Silver Dust have been greatly improved.\n- Collection Sorting Order Changed\n    - To make it easier to check ongoing collections, completed collections are now sorted to the bottom.\n    - Newly added collections will appear at the top for easier checking.\n\n<b>November Season Pass</b>\n\n- The \"Collection Master Pass\" commemorating the November collection overhaul begins.\n    - Earn the \"Collection Master\" title through this season pass.\n\n<b>November Event</b>\n\n- Throughout November, various rewards will be added to patrol rewards to help you continue enjoying your adventures.\n\n<b>Game Improvements</b>\n\n- Fixed an issue in the mobile version where background app sounds would stop unexpectedly."
        },
        {
            "Header": "v200230",
            "Date": "30.09.2024",
            "Contents": "<b>Custom Equipment Crafting System Added</b>\n\n- A new custom equipment system that uses new materials, Scrolls and Circles, has been added.\n    - This menu unlocks after clearing Stage 301.\n    - You can craft three types of items: Weapons, Necklaces, and Rings.\n    - You can choose your desired appearance from a variety of options, and each time, the stats and skills will be randomly generated.\n    - Every time you craft, your relationship will increase by 1. As your relationship increases, you’ll be able to craft equipment with more diverse appearances and stronger stats.\n- <b>Materials Acquisition</b>\n    - Scrolls can be obtained through Monster Collection item rewards and custom equipment grinding.\n    - Circles can be obtained from Adventure Boss, World Boss rewards, and custom equipment grinding.\n- For more details, check the Medium announcement.\n\n<b>Monster Collection Rewards Added</b>\n\n- A new material, Scrolls, for custom equipment crafting has been added to the Monster Collection rewards.\n- Available from the 500 NCG range and above.\n- To receive this reward, you need to migrate to the new Monster Collection contract.\n\n<b>October Event</b>\n\n- Throughout October, various rewards will be added to patrol rewards to help you enjoy more adventurous gameplay.\n- To support growth through equipment crafting, the block cost required for world equipment crafting will be reduced by 20% throughout October.\n- For more details, check the Medium announcement.\n\n<b>October Season Pass</b>\n\n- The Halloween-themed \"Hallowinners Pass\" will begin in October.\n    - You can get the Hallowinners title through this season pass.\n- For more details, check the Medium announcement.\n\n<b>Game Improvements</b>\n\n- <b>Grinding System Improvement</b>\n    - When grinding equipment, additional material items will now drop alongside Crystals.\n- <b>Crafting Slot Expansion</b>\n    - You can now open up to 4 additional crafting slots using NCG, Crystals, Golden Dust, or Ruby Dust.\n- <b>Batch Craft Completion</b>\n    - A new feature has been added that allows you to complete all currently crafting slots at once using Hourglasses.\n- <b>Adventure Boss Improvement</b>\n    - As mentioned in NCIP - 21, adventure bosses for each season will be improved to prevent the selection of bosses that appeared in the previous two rotations.\n- <b>Armor Icon Change</b>\n    - The avatar armor icons and the equipment armor icons have been separated for better distinction.\n- <b>Collection Addition</b>\n    - One new title from the Season Pass rewards has been added.\n- <b>PC Version Shop Improvement</b>\n    - The default sorting criteria for each category has been updated.\n\n<b>Bug Fixes</b>\n\n- Fixed a bug where the result screen would freeze and not appear after completing event dungeons due to quest processing."
        },
        {
            "Header": "v200220",
            "Date": "28.08.2024",
            "Contents": "<b>World Boss Improvements</b>\n\n- We are preparing long-term improvements for the World Boss system. The details of these changes will be decided and implemented in collaboration with the community through NCIP. Please stay tuned.\n- Ahead of these long-term adjustments, we have made short-term changes to enhance the World Boss specs and adjust the percentage of players who can achieve the highest rank.\n- The stat balance of the 6 Runes (3 Fenrir, 3 Saehrimnir) from the World Boss has been adjusted. Only the stats have been increased, with no changes to skill effects.\n\n<b>September Event</b>\n\n- The returning Crystal Equipment Event will allow you to embark on your adventures with more crystals than before.\n- Additionally, throughout September, the Patrol Reward System will offer various rewards to help you continue your exciting adventures.\n- Detailed information can be found in the Medium announcement.\n\n<b>September Season Pass</b>\n\n- The Odin’s Treasure Pass, celebrating new Odin-related content in September, will begin.\n    - You can earn the \"Odin’s Warrior\" title through this Season Pass.\n- Detailed information can be found in the Medium announcement.\n\n<b>Game Improvements</b>\n\n- Collection Additions\n    - Added collections for 2 title rewards and 4 costumes from previous Season Passes.\n    - Added a collection for 3 food items from the CITRUS CARNIVAL event dungeon.\n- Adventure Boss Improvements\n    - Fixed an issue where the reward list for the Adventure Boss challenge and rush was not fully displayed.\n    - Adjusted so that the icon will not be displayed if the NCG reward is 0 or below.\n- Mobile QR Backup Improvement\n    - Improved the export process by increasing the image size for better recognition.\n- Fixed an issue where the package name of mobile items purchased on different platforms was not displayed correctly in the mail.\n\n<b>Bug Fixes</b>\n\n- Fixed a bug where the client displayed results differently from the actual clear results when challenging Adventure Boss.\n- Fixed a bug where the background would shift up or down during battle simulations."
        }
    ]
}