{
    "NoticeData": [
        {
            "Header": "v200230",
            "Date": "30.09.2024",
            "Contents": "<b>カスタム装備制作システムの追加</b>\n\n- 新しい素材「スクロール」と「サークル」を使用したカスタム装備システムが追加されました。\n    - このメニューはステージ301をクリア後に解放されます。\n    - 武器、ネックレス、リングの3種類のアイテムを制作できます。\n    - 多様な外観から希望するものを選ぶことができ、ステータスとスキルは毎回ランダムに生成されます。\n    - 製作するたびに親密度が1増加します。親密度が上がると、より多様な外観と強力なステータスの装備を制作できるようになります。\n- <b>素材の取得方法</b>\n    - スクロールはモンスターコレクションのアイテム報酬やカスタム装備のグラインディングから入手できます。\n    - サークルはアドベンチャーボス、ワールドボスの報酬、カスタム装備のグラインディングから入手できます。\n- 詳細はMediumの発表をご確認ください。\n\n<b>モンスターコレクション報酬の追加</b>\n\n- カスタム装備制作用の新しい素材「スクロール」がモンスターコレクションの報酬に追加されました。\n- 500 NCG以上の範囲から利用可能です。\n- この報酬を受け取るためには、新しいモンスターコレクション契約に移行する必要があります。\n\n<b>10月のイベント</b>\n\n- 10月を通して、より冒険的なゲームプレイを楽しむために様々な報酬がパトロール報酬に追加されます。\n- 装備制作による成長を支援するため、10月を通してワールド装備制作に必要なブロックコストが20％削減されます。\n- 詳細はMediumの発表をご確認ください。\n\n<b>10月シーズンパス</b>\n\n- ハロウィーンテーマの「ハロウィナーズパス」が10月に開始されます。\n    - このシーズンパスを通じて「ハロウィナーズ」の称号を獲得できます。\n- 詳細はMediumの発表をご確認ください。\n\n<b>ゲーム改善</b>\n\n- <b>グラインディングシステムの改善</b>\n    - 装備をグラインディングする際、クリスタルに加えて追加の素材アイテムがドロップするようになります。\n- <b>制作スロットの拡張</b>\n    - NCG、クリスタル、ゴールデンダスト、ルビーダストを使用して最大4つの追加制作スロットを開放できます。\n- <b>一括制作完了</b>\n    - 砂時計を使用して、現在制作中の全てのスロットを一度に完了させる新しい機能が追加されました。\n- <b>アドベンチャーボスの改善</b>\n    - NCIP-21で述べたように、各シーズンのアドベンチャーボスは、前の2回のローテーションで登場したボスが選択されないように改善されます。\n- <b>アーマーアイコンの変更</b>\n    - アバターのアーマーアイコンと装備のアーマーアイコンが区別されるように分けられました。\n- <b>コレクションの追加</b>\n    - シーズンパスの報酬から新しい称号が1つ追加されました。\n- <b>PCバージョンショップの改善</b>\n    - 各カテゴリのデフォルトのソート基準が更新されました。\n\n<b>バグ修正</b>\n\n- クエスト処理によりイベントダンジョンを完了後、リザルト画面がフリーズして表示されないバグを修正しました。"
        },
        {
            "Header": "v200220",
            "Date": "28.08.2024",
            "Contents": "<b>ワールドボス改善</b>\n\n- ワールドボスシステムの長期的な改善を準備中です。この詳細な部分については、NCIPを通じてコミュニティと共に決定および改善を進めていく予定です。少々お待ちください。\n- この長期的な調整に先立ち、短期的にはワールドボスのスペックを上方修正し、最上位ランクを獲得するプレイヤーの割合を調整しました。\n- ワールドボス報酬のルーン6種（フェンリル3種、セーフリムニル3種）のステータスバランスが変更されました。スキル効果には調整がなく、ステータスのみが上方修正されました。\n\n<b>9月イベント</b>\n\n- 帰ってきたクリスタル装備イベントで、以前より多くのクリスタルを持って冒険を進めることができます。\n- また、9月1か月間、パトロールリワードシステムでも様々な報酬を通じて楽しい冒険を続けられるよう支援します。\n- 詳細はMediumのお知らせでご確認いただけます。\n\n<b>9月シーズンパス</b>\n\n- 9月に新たに登場するオーディンに関連したコンテンツを記念して、オーディンの宝物パスが開始されます。\n    - オーディンの勇者タイトルをこのシーズンパスで獲得できます。\n- 詳細はMediumのお知らせでご確認いただけます。\n\n<b>ゲーム改善</b>\n\n- コレクション追加\n    - 既存シーズンパス報酬の称号2種およびコスチューム4種に関連するコレクションを追加。\n    - CITRUS CARNIVALイベントダンジョンの料理3種のコレクションを追加。\n- アドベンチャーボス改善\n    - アドベンチャーボスのチャレンジおよびラッシュの報酬リストが全て表示されなかった部分を修正しました。\n    - 報酬のNCGが0以下の場合、アイコンが表示されないように修正しました。\n- モバイルQRバックアップ改善\n    - 以前より大きな画像でエクスポートされ、認識が向上するよう改善しました。\n- 異なるプラットフォームで購入したモバイル商品のパッケージ名がメールで正しく表示されなかった部分を改善しました。\n\n<b>バグ修正</b>\n\n- アドベンチャーボス挑戦時、実際のクリア結果と異なってクライアントに表示されるバグを修正しました。\n- バトルシミュレーション中に背景が上下に移動するバグを修正しました。"
        },
        {
            "Header": "v200210",
            "Date": "30.07.2024",
            "Contents": "<b>アイテムアップグレードにハンマー使用システムを追加</b>\n\n- アイテムアップグレード時にアドベンチャーボスで取得したハンマーを使用して経験値を追加できるシステムが追加されました。\n- ハンマーは武器、鎧、ベルト、ネックレス、指輪の強化に使用できます。\n\n<b>8月イベント</b>\n\n- 8月の1ヶ月間開催されるイベントダンジョン『シトラスカーニバル』がオープンされます。\n- このダンジョンではゴールデンダスト、イベント専用の食べ物、イベント用メダルを入手できます。\n- 詳細な説明はMediumで案内される予定です。\n\n<b>8月シーズンパス</b>\n\n- バウンティハンターの称号を獲得できるシーズンパス9が準備されました。\n- 既存のシーズンパスよりも多くの報酬を提供するシーズンパス9を通じて、アドベンチャーボスからより多くの報酬を獲得してください。\n\n<b>ゲーム改善</b>\n\n- インベントリ改善\n    - 強化時の材料選択部分の並び順を実使用に合わせて改善しました。\n        - 材料タブの上部にAPポーション、砂時計、ダスト類に続いてハンマーがすぐに確認できるように並び順を変更しました。\n        - 基本的に1次並びは希少度の降順で行い、同じ希少度ではCPの降順で表示されます。\n- アドベンチャーボス改善\n    - シーズン進行および次のシーズン待機時に前シーズンの要約情報を表示する機能が追加されました。\n    - 自分の情報に貢献度の%をすぐに確認できるように表示機能が追加されました。\n\n<b>バグ修正</b>\n\n- ワールドボスプレイ中に無限ローディングになる現象を改善\n- 点検およびアップデート案内バックアップのキーバックアップ機能が正常動作しない現象を改善\n- グラインディングを連続で試みると取得クリスタルの数量が正常に表示されない現象を改善"
        }
    ]
}