{
    "NoticeData": [
        {
            "Header": "v200220",
            "Date": "28.08.2024",
            "Contents": "<b>World Boss Improvements</b>\n\n- We are preparing long-term improvements for the World Boss system. The details of these changes will be decided and implemented in collaboration with the community through NCIP. Please stay tuned.\n- Ahead of these long-term adjustments, we have made short-term changes to enhance the World Boss specs and adjust the percentage of players who can achieve the highest rank.\n- The stat balance of the 6 Runes (3 Fenrir, 3 Saehrimnir) from the World Boss has been adjusted. Only the stats have been increased, with no changes to skill effects.\n\n<b>September Event</b>\n\n- The returning Crystal Equipment Event will allow you to embark on your adventures with more crystals than before.\n- Additionally, throughout September, the Patrol Reward System will offer various rewards to help you continue your exciting adventures.\n- Detailed information can be found in the Medium announcement.\n\n<b>September Season Pass</b>\n\n- The Odin’s Treasure Pass, celebrating new Odin-related content in September, will begin.\n    - You can earn the \"Odin’s Warrior\" title through this Season Pass.\n- Detailed information can be found in the Medium announcement.\n\n<b>Game Improvements</b>\n\n- Collection Additions\n    - Added collections for 2 title rewards and 4 costumes from previous Season Passes.\n    - Added a collection for 3 food items from the CITRUS CARNIVAL event dungeon.\n- Adventure Boss Improvements\n    - Fixed an issue where the reward list for the Adventure Boss challenge and rush was not fully displayed.\n    - Adjusted so that the icon will not be displayed if the NCG reward is 0 or below.\n- Mobile QR Backup Improvement\n    - Improved the export process by increasing the image size for better recognition.\n- Fixed an issue where the package name of mobile items purchased on different platforms was not displayed correctly in the mail.\n\n<b>Bug Fixes</b>\n\n- Fixed a bug where the client displayed results differently from the actual clear results when challenging Adventure Boss.\n- Fixed a bug where the background would shift up or down during battle simulations."
        },
        {
            "Header": "v200210",
            "Date": "30.07.2024",
            "Contents": "<b>Item Upgrade Hammer System Added</b>\n\n- A system has been added where you can use hammers obtained from Adventure Bosses to add experience during item upgrades.\n- Hammers can be used to enhance weapons, armor, belts, necklaces, and rings.\n\n<b>August Event</b>\n\n- The event dungeon 'Citrus Carnival,' which will run throughout August, is now open.\n- In this dungeon, you can obtain Golden Dust, event-exclusive food, and event medals.\n- Detailed information will be provided through Medium.\n\n<b>August Season Pass</b>\n\n- Season Pass 9, which allows you to obtain the title of Bounty Hunter, is now ready.\n- Season Pass 9 offers more rewards than previous passes, allowing you to get more rewards from Adventure Bosses.\n\n<b>Game Improvements</b>\n\n- Inventory Improvements\n    - The sorting of the material selection part during enhancement has been improved for practical use.\n        - The sorting order of the material tab has been changed so that hammers can be immediately checked after AP Potions, Hourglasses, and Dusts at the top.\n        - By default, the first sorting is in descending order of rarity, and items of the same rarity are displayed in descending order of CP.\n- Adventure Boss Improvements\n    - A function to display summary information of the last season during the season progress and the waiting time for the next season has been added.\n    - A feature has been added to show the contribution percentage directly in my information.\n\n<b>Bug Fixes</b>\n\n- Fixed the issue of infinite loading during World Boss play.\n- Fixed the issue where the backup function of the maintenance and update guide backup key was not working properly.\n- Fixed the issue where the number of crystals obtained was not displayed correctly when attempting grinding consecutively."
        },
        {
            "Header": "v200200",
            "Date": "09.07.2024",
            "Contents": "<b>Adventure Boss System Added</b>\n\n- The Adventure Boss System has been added.\n    - Players can become operating users with NCG and receive rewards such as Golden, Ruby, or Emerald Dust, as well as new Critical Rune stones.\n    - Participate in raids using AP Potions and receive rewards like hammers, NCG, dust, and new rune stones.\n        - One random player among the participants will receive 5% of the total operating amount in NCG as a reward.\n        - Participants will share 15% of the operating amount in NCG based on their contribution.\n    - The timing of the Adventure Boss opening is determined by the decentralized participation of players and must be defeated within 4 hours of opening. Once the season ends, it can be reopened after 10,800 blocks.\n- For more details about the Adventure Boss System, please check the following article:\n    - [Introducing Adventure Boss](https://medium.com/nine-chronicles/9cm-introducing-adventure-boss-eda4712cd2e2)\n\n<b>Grimoire Equipment and Summoning System Added</b>\n\n- Grimoire equipment, which can be summoned using Emerald Dust, has been added.\n    - The equipment obtained from summoning is non-tradable by default.\n    - A total of 36 types of equipment have been added, comprising 3 skill types, 4 grade levels, and 3 sub-stats.\n- Grimoire equipment can be equipped in the newly added Grimoire equipment slot.\n- Emerald Dust can be obtained as operational rewards and raid rewards in the Adventure Boss System.\n\n<b>Game Improvements</b>\n\n- Equipment Crafting Balance Changes\n    - The crafting experience for Epic, Unique, Legendary, and Sacred grade equipment has been greatly improved.\n        - The crafting cost for premium recipes has been significantly reduced.\n            - The amount of materials required and the waiting blocks generated during crafting have been greatly decreased.\n        - The chance of attaching skills to equipment has been greatly increased.\n        - The amount of crystals needed to unlock recipes has been drastically reduced.\n    - The NCG required to enhance Normal, Rare, Epic, and Unique grade equipment has been reduced by 50%.\n- Stage Balance Changes\n    - The stats of monsters in Worlds 6, 7, and 8 have been significantly decreased.\n- Change in World Boss Ranking Calculation Method\n    - To ensure a consistent experience in ranking methods, the World Boss ranking calculation method has been changed to an arena-style system where ties are ranked lower.\n    - The current issue of multiple ties at the S grade level, leading to a lack of distinction in rankings, will be addressed in collaboration with the community this quarter.\n- Addition of 11 New Collections\n    - New collections have been added, including the newly introduced Emerald Dust and the June Season Pass title-related collections."
        }
    ]
}