{
    "NoticeData": [
        {
            "Header":"[Patch Note] v200020",
            "Date":"31.05.2023",
            "Contents":"<b>[Improvement]</b>\n\n<b>World 7 Open</b>\n\n- <b>Introduction to the new world</b>\n    - The world of Niflheim is added.\n        - New stages from 301 to 350 are added.\n        - New monsters have high defense and use debuff skills.\n    - New items are added.\n        - New equipment is legendary grade and a total of 25 types are added.\n        - New Food recipes increase ATK, DEF stats and 6 types are added.\n    - New skill are added.\n        - Stat debuffs: an effect that reduces opponent's stats is added.\n        - Defense ignoring damage: gives additional damage. The maximum damage cannot exceed the opponent's defense.\n        - Thorns damage: inflicts damage on the attacker when hit.\n        - Healing: recovers your own health.\n\n- <b>Changes</b>\n    - Changes in Upgrade probability\n        - Legendary grade equipment does not fail when Upgrade.\n    - Method of displaying equipment crafting options\n        - Legendary grade equipment has special crafting options, not the Basic, Premium, and Mimir recipes.\n    - Addition of equipment effect information window\n        - A tooltip button is added in the equipment information window where you can view the details of skill.\n\n- <b>Equipment Crafting Quests</b>\n    - The crafting quests for weapons and armor provide rewards of materials that are of a different grade than the equipment.\n    - There's an issue where, during the process of changing the grade of existing equipment, the quest rewards remain fixed at the previous grade, providing rewards of materials that are lower in grade than the equipment.\n\n- <b>Related Link: https://ninechronicles.medium.com/9c-developers-commentary-part-02-changes-with-equipment-in-world-7-186e2179f1f4</b>\n\n<b>[Bugfix]</b>\n\n- Fixed an issue where you couldn't send actions if the amount of crystals obtained from grinding exceeds the size of int."
        },
        {
            "Header":"[Patch Note] v200010",
            "Date":"02.05.2023",
            "Contents":"<b>[Improvement]</b>\n\n<b>9c Monster Collection Improvements</b>\n\n- The weekly rewards of 1 to 5 levels will be raised.\n- Levels 6 and 7 are newly added.\n\n<b>PBFT Event Open</b>\n\n- <b>Event Duration</b>\n    - May 3rd - May 16th (UTC)\n- <b>Event Introduction</b>\n    - The level of monsters appearing in Worlds 1 to 6 is reduced by a certain amount.\n    - The Buff Gauge required to use the stage one-time Buff is reduced.\n    - The required cp required to turn the stage sweep is reduced.\n- <b>Event changes</b>\n    - Level reduction by stage\n    - Reduces stage one-time Buff Gauge by 2/3.\n    - Reduces required CP by stage by 1/3.\n\n<b>Game Improvement</b>\n\n- <b>Shop improvement</b>\n    - Improved shop filter function.\n    - The loading status is displayed in the top AP bar while using the AP.\n- <b>Improves pet performance</b>\n    - All pets will perform 50-100% better than before.\n- <b>Render any battles cleared while using Repeat.</b>\n- <b>D:CC UI improvement</b>\n    - A pop-up is added for confirmation before connecting to an external link.\n\n<size=200%>Bugfix</size>\n\n- The font size that was invading the area has been modified.\n- Sweep in progress on the stage currently in progress, Fixed an issue where the box was printed small.\n- I corrected the error that did not include the amount in the mailbox message after selling Stone type items.\n- Fixed an issue where the top UI was not output when changing characters.\n- Fixed an issue where the stars of the equipment were not printed on the Sell tab.\n- Fixed an issue where event pop-ups block the screen during the tutorial."
        },
        {
            "Header":"[Patch Note] v200000",
            "Date":"06.04.2023",
            "Contents":"<b>[Improvement]</b>\n<b>Libplanet PBFT Switch</b>\n- Converted the chain's consensus algorithm to the PBFT algorithm."
        }
    ]
}