{
    "NoticeData": [
        {
            "Header":"[업데이트 내용] v200110",
            "Date":"??????",
            "Contents":"넣어야하는데 바빠서 깜빡했어요 데헷큥 한글 패치노트 테스트용"
        },
        {
            "Header":"[Patch Note] v200091",
            "Date":"2023년 10월 13일",
            "Contents":"<b>[ 개선사항 ]</b>\n\nAdd rewards when creating new avatars\n- Crystal 200000, Long Sword, Casual Clothes\n\nChange Lobby Image\n- Rearrange background and each content location\n\nChange the loading image\n- Display loading images by adventure, arena, shop, workshop content\n\nChange New Avatar Tutorial\n\n<b>[ Bugfix ]</b>\n\nCorrected the part where the acquired crystal calculation is not properly calculated when grinding the upgraded aura."
        },
        {
            "Header":"[Patch Note] v200090",
            "Date":"06.10.2023",
            "Contents":"<b>[ Added 'Patrol Reward' Function ]</b>\nEarn a set reward every 12 hours depending on the level.\nRewards can be earned every 12 hours over time even if you're not connected to the game.\nCan earn crystal and silver dust rewards.\n\n<b>[ Added Nimble Aura Summon ]</b>\nNimble Aura Summon Additional Open to Summon with 10 Silver Dusts\n1 out of 3 grades can be obtained by summoning.\n\n<b>[ Added Nimble Aura equipment ]</b>\nAdd Nimble Aura equipment that all users can summon more than once a day\nSame aura confinement can be used as a reinforcing material\nThe Nimble Aura is not eligible for purchase through NCG or for Voucher events."
        },
        {
            "Header":"[Patch Note] v200080",
            "Date":"25.09.2023",
            "Contents":"<b>[ Added 'Summon' Function ]</b>\n\nAdded 'Summon' menu in the workshop\n\nThrough the Summon function, equipment recipes for crafting will be randomly determined, allowing you to obtain equipment.\n\nEquipment can be acquired immediately without any waiting period.\n\nAble to Summon various grades of Beast Aura.\n\n<b>[ Added Aura equipment ]</b>\n\nAdded additional slot with equipment subtype as Aura\n\nOnly equipment created through the Summon function can be worn in the Aura equipment slot.\n\nAura equipment adds effects to your avatar.\n\nFor more details, please refer to the following link: [https://bit.ly/9CUpdate_Intro_to_Aura](https://bit.ly/9CUpdate_Intro_to_Aura)\n\n<b>[ Monster Collection Improvement ]</b>\n\nWe will provide a notification when the Monster Collection rewards have been changed.\n\nYou can choose to adhere to the new reward policy or maintain the existing one after confirming the changes in the reward policy.\n\nIf you switch to the new reward policy, it will reset aspects of your contract, including termination and reward collection timing.\n\nFor more details, please refer to the following link: https://github.com/planetarium/NCIPs/blob/e105d87f152c42fcc6958aa4f545e131d7deb04a/NCIP/ncip-17.md"
        }
    ]
}
