{
    "NoticeData": [
        {
            "Header": "v200270",
            "Date": "27.01.2025",
            "Contents":"<b>NCG Claim Feature Addition and Stake Amount Adjustment Process Update</b>\n\n- NCG Claim Distribution:\n    - NCG used across each chain will now be distributed to staking users at a fixed percentage every block.\n    - The total distributed amount will be divided proportionally based on the total staked NCG amount.\n    - Once the accumulated amount exceeds a certain threshold, users will be able to claim their rewards.\n- Stake Adjustment Policy Update:\n    - The previous 4-week lockup period required to decrease staked amounts has been removed.\n    - However, if the staked NCG amount is reduced, the excess amount will only be refunded after 75,600 blocks (approximately one week) from the adjustment block.\n        - While the reduced NCG is being processed for return, additional reduction requests cannot be made.\n    - This adjustment is part of the Proof-of-Stake (PoS) policy, and further detailed explanations will be provided in upcoming announcements.\n\n---\n\n<b>Costume Summoning and Synthesis Features Added</b>\n\n- In response to the overall enhancement of equipment and rune balance, the stats of all previously distributed costumes have been adjusted upward.\n- Additionally, a summoning feature has been added for 22 of the newly adjusted costumes, allowing players to acquire them through summons.\n- Costumes obtained via summoning can also be acquired through synthesis.\n\n---\n\n<b>Game Improvement</b>\n\n- Patrol reward stabilization\n- Improvement of event dungeon ticket and AP point overlap issue\n- Added feature to prioritize sellable items in the PC shop 'Sell' section\n- Added planet name to push notifications in the mobile client\n- Improved mobile client to display only accessible planets when some planets are unavailable"
        },
        {
            "Header": "v200260",
            "Date": "20.12.2024",
            "Contents": "<b>Synthesis System Added</b>\n\n- <b>New Feature</b>: The new synthesis system allows you to combine multiple lower-rarity pieces of equipment to potentially create a single piece of higher-rarity equipment.\n- <b>Applicable Equipment</b>: <b>Aura</b> and <b>Grimoire</b> gear.\n- <b>How It Works</b>:\n    - Select multiple lower-rarity items as materials.\n    - Initiate a synthesis attempt to produce a higher-rarity item.\n    - On success, you receive an item of the next rarity tier. On failure, you obtain an item of the same rarity tier as the materials used.\nFor more detailed instructions and specifics, please refer to [NCIP-23](https://github.com/planetarium/NCIPs/blob/ncip-23/NCIP/ncip-23.md).\n\n<b>3 New Sacred Auras Added</b>\n\n- <b>Aegis</b>, <b>Barrage</b>, and <b>Beast</b> Sacred-Grade Auras have been introduced.\n- They can be obtained through <b>Golden Dust Summons</b> and <b>Ruby Dust Summons</b> in the Aura Summons menu.\n\n<b>Ragnarok Collaboration Event Dungeon Added</b>\n\n- <b>Event Duration</b>: From <b>December 20, 2024, 5:00 AM (UTC)</b> to <b>January 10, 2025, 5:00 AM (UTC)</b>\n- <b>Unique Event Food</b>: Provides boosts comparable to items found in Worlds 7–8.\n- <b>Abundant EXP</b>: Earn <b>11 EXP per stage</b> for rapid leveling.\n- <b>Generous Rewards</b>: Obtain Golden Dust, hammers, hourglasses, and exclusive crafting materials.\n\n<b>Mobile Mileage Integration</b>\n\n- Mileage earned from Odin, Heimdall, and Thor Planets has now been consolidated.\n- This unified mileage will accumulate when purchasing items from the mobile shop on any planet.\n- Unified mileage can be spent across all planets, except for Thor.\n\n<b>New Items Added to Mileage Shop</b>\n\n- <b>1 Costume</b> and <b>1 Title</b> added to the Mileage Shop.\n- <b>1 Golden Thor Rune</b> and <b>1 Golden Meat</b> items added to the Mileage Shop.\n\n<b>Game Improvements</b>\n\n- <b>Rune Equipment Fix</b>: Resolved an issue that prevented proper rune equipping when non-owned runes were erroneously equipped."
        },
        {
            "Header": "v200250",
            "Date": "28.11.2024",
            "Contents": "<b>Custom Equipment Adjustments</b>\n\n- <b>Introduction of MAX Values for Custom Equipment with Damage Reduction Based on HIT Count</b>\n    - Damage reduction capped at a maximum of 30%.\n        - This restriction applies only to custom equipment. When both custom equipment and the Golden Leaf Rune are equipped, damage reduction can function up to a maximum of 81%.\n    - Additional adjustments are being made to address other potential issues. Soon, overall Min and Max values will be implemented, and this process will be carried out in consultation with the community.\n        - For the next release, version 200260, we are working with the development team to evaluate whether it can function as originally described. Once the release is finalized, we will provide a detailed explanation regarding the adjustments and changes.\n- <b>Skill and Stat Growth Adjustments for Equipment Upgrades</b>\n    - Updated growth efficiency for Normal to Unique and Legendary grades.\n        - The adjustment to upgrade efficiency has been pre-applied to the mainnet on November 25, 2024, to minimize any impact. If further adjustments are made based on this test, they will be updated accordingly.\n\n<b>Nine Chronicles M 1st Anniversary Events</b>\n\n- <b>Free Costume Event</b>\n    Celebrate the 1st anniversary with a free costume giveaway.\n\n- <b>Patrol Rewards Event</b>\n    Enhanced patrol rewards to commemorate the milestone.\n\n- <b>Double Content Rewards Event</b>\n    Earn double or more rewards in various content during the anniversary period.\n\n- <b>1st Anniversary Event Dungeon</b>\n    - Features bosses and monsters from Worlds 1-8.\n    - Obtain new event materials, AP potions, hourglasses, and rare rewards such as hammers, Golden Dust, Ruby Dust, and Emerald Dust.\n    - Designed with higher balance levels than regular event dungeons, allowing players to gain better rewards based on their progress.\n    - Collect event materials to craft <b>Aura & Grimoire anniversary event equipment</b>.\n\n- <b>1st Anniversary Season Event Chain - Thor</b>\n    - Limited-time event lasting only 3 months.\n    - Experience growth 5x faster than normal.\n    - Includes goals such as improved Arena rules and guild play testing.\n    - Detailed information about Thor will be provided through Medium later this week.\n\n<b>Summoning System Improvements</b>\n\n- <b>UI Enhancements</b>\n    - Updated layout and visuals focused on summoning results.\n- <b>110 Summon Feature Added</b>\n    - Players can now summon 110 items at once.\n- <b>Rune Summons with Emerald Dust</b>\n    - A new option for summoning runes using Emerald Dust has been introduced.\n- <b>4 New Divine Grade Runes Added</b>\n    - 2 Loki Vampiric Runes for stages or World Boss usage.\n    - 2 Thor Strike Runes for stages or World Boss usage.\n\n<b>New Season Pass Additions</b>\n\n- <b>Courage Pass</b>\n    The existing Season Pass has been renamed but retains the same functionality.\n\n- <b>Adventure Boss Pass</b>\n    - Resets monthly.\n    - Designed to provide additional rune shards as rewards from Adventure Bosses and Monster Collections.\n\n- <b>World Clear Pass</b>\n    - Can only be earned once per account.\n    - Does not reset monthly.\n    - Grants rewards for clearing every 10 stages from Worlds 1 to 8.\n    - Allows for increased summoning and content engagement using Golden Dust even with just the base rewards.\n\n<b>Mobile Mileage Shop Open</b>\n\n- Earn 8 points for every $1 spent on item purchases.\n- 11 mileage-exclusive items are available for purchase.\n\n<b>Game Improvements</b>\n\n- Added a \"No Skill\" condition to the collection filter.\n- Fixed an issue where it was not possible to change the amount when Monster Collection was in a migratable state."
        }
    ]
}