{
    "NoticeData": [
        {
            "Header": "v200230",
            "Date": "30.09.2024",
            "Contents": "Custom Equipment Crafting System Added\n\n- A new custom equipment system that uses new materials, Scrolls and Circles, has been added.\n    - This menu unlocks after clearing Stage 301.\n    - You can craft three types of items: Weapons, Necklaces, and Rings.\n    - You can choose your desired appearance from a variety of options, and each time, the stats and skills will be randomly generated.\n    - Every time you craft, your relationship will increase by 1. As your relationship increases, you’ll be able to craft equipment with more diverse appearances and stronger stats.\n- **Materials Acquisition**\n    - Scrolls can be obtained through Monster Collection item rewards and custom equipment grinding.\n    - Circles can be obtained from Adventure Boss, World Boss rewards, and custom equipment grinding.\n- For more details, check the Medium announcement.\n\n### Monster Collection Rewards Added\n\n- A new material, Scrolls, for custom equipment crafting has been added to the Monster Collection rewards.\n- Available from the 500 NCG range and above.\n- To receive this reward, you need to migrate to the new Monster Collection contract.\n\n### October Event\n\n- Throughout October, various rewards will be added to patrol rewards to help you enjoy more adventurous gameplay.\n- To support growth through equipment crafting, the block cost required for world equipment crafting will be reduced by 20% throughout October.\n- For more details, check the Medium announcement.\n\n### October Season Pass\n\n- The Halloween-themed \"Hallowinners Pass\" will begin in October.\n    - You can get the Hallowinners title through this season pass.\n- For more details, check the Medium announcement.\n\n### Game Improvements\n\n- **Grinding System Improvement**\n    - When grinding equipment, additional material items will now drop alongside Crystals.\n- **Crafting Slot Expansion**\n    - You can now open up to 4 additional crafting slots using NCG, Crystals, Golden Dust, or Ruby Dust.\n- **Batch Craft Completion**\n    - A new feature has been added that allows you to complete all currently crafting slots at once using Hourglasses.\n- **Adventure Boss Improvement**\n    - As mentioned in NCIP - 21, adventure bosses for each season will be improved to prevent the selection of bosses that appeared in the previous two rotations.\n- **Armor Icon Change**\n    - The avatar armor icons and the equipment armor icons have been separated for better distinction.\n- **Collection Addition**\n    - One new title from the Season Pass rewards has been added.\n- **PC Version Shop Improvement**\n    - The default sorting criteria for each category has been updated.\n\n### Bug Fixes\n\n- Fixed a bug where the result screen would freeze and not appear after completing event dungeons due to quest processing."
        },
        {
            "Header": "v200220",
            "Date": "28.08.2024",
            "Contents": "<b>World Boss Improvements</b>\n\n- We are preparing long-term improvements for the World Boss system. The details of these changes will be decided and implemented in collaboration with the community through NCIP. Please stay tuned.\n- Ahead of these long-term adjustments, we have made short-term changes to enhance the World Boss specs and adjust the percentage of players who can achieve the highest rank.\n- The stat balance of the 6 Runes (3 Fenrir, 3 Saehrimnir) from the World Boss has been adjusted. Only the stats have been increased, with no changes to skill effects.\n\n<b>September Event</b>\n\n- The returning Crystal Equipment Event will allow you to embark on your adventures with more crystals than before.\n- Additionally, throughout September, the Patrol Reward System will offer various rewards to help you continue your exciting adventures.\n- Detailed information can be found in the Medium announcement.\n\n<b>September Season Pass</b>\n\n- The Odin’s Treasure Pass, celebrating new Odin-related content in September, will begin.\n    - You can earn the \"Odin’s Warrior\" title through this Season Pass.\n- Detailed information can be found in the Medium announcement.\n\n<b>Game Improvements</b>\n\n- Collection Additions\n    - Added collections for 2 title rewards and 4 costumes from previous Season Passes.\n    - Added a collection for 3 food items from the CITRUS CARNIVAL event dungeon.\n- Adventure Boss Improvements\n    - Fixed an issue where the reward list for the Adventure Boss challenge and rush was not fully displayed.\n    - Adjusted so that the icon will not be displayed if the NCG reward is 0 or below.\n- Mobile QR Backup Improvement\n    - Improved the export process by increasing the image size for better recognition.\n- Fixed an issue where the package name of mobile items purchased on different platforms was not displayed correctly in the mail.\n\n<b>Bug Fixes</b>\n\n- Fixed a bug where the client displayed results differently from the actual clear results when challenging Adventure Boss.\n- Fixed a bug where the background would shift up or down during battle simulations."
        },
        {
            "Header": "v200210",
            "Date": "30.07.2024",
            "Contents": "<b>Item Upgrade Hammer System Added</b>\n\n- A system has been added where you can use hammers obtained from Adventure Bosses to add experience during item upgrades.\n- Hammers can be used to enhance weapons, armor, belts, necklaces, and rings.\n\n<b>August Event</b>\n\n- The event dungeon 'Citrus Carnival,' which will run throughout August, is now open.\n- In this dungeon, you can obtain Golden Dust, event-exclusive food, and event medals.\n- Detailed information will be provided through Medium.\n\n<b>August Season Pass</b>\n\n- Season Pass 9, which allows you to obtain the title of Bounty Hunter, is now ready.\n- Season Pass 9 offers more rewards than previous passes, allowing you to get more rewards from Adventure Bosses.\n\n<b>Game Improvements</b>\n\n- Inventory Improvements\n    - The sorting of the material selection part during enhancement has been improved for practical use.\n        - The sorting order of the material tab has been changed so that hammers can be immediately checked after AP Potions, Hourglasses, and Dusts at the top.\n        - By default, the first sorting is in descending order of rarity, and items of the same rarity are displayed in descending order of CP.\n- Adventure Boss Improvements\n    - A function to display summary information of the last season during the season progress and the waiting time for the next season has been added.\n    - A feature has been added to show the contribution percentage directly in my information.\n\n<b>Bug Fixes</b>\n\n- Fixed the issue of infinite loading during World Boss play.\n- Fixed the issue where the backup function of the maintenance and update guide backup key was not working properly.\n- Fixed the issue where the number of crystals obtained was not displayed correctly when attempting grinding consecutively."
        }
    ]
}