{
    "NoticeData": [
        {
            "Header": "v200200",
            "Date": "09.07.2024",
            "Contents": "<b>어드벤쳐 보스 시스템 추가</b>\n\n- 어드벤쳐 보스 시스템이 추가되었습니다.\n    - NCG로 운영 유저가 되어고, 골든 or 루비 or 에메랄드 더스트나 신규 크리티컬 룬 조각을 보상으로 받을 수 있습니다.\n    - AP포션으로 토벌에 참여하고, 해머와 NCG, 더스트와 신규 룬 조각을 보상으로 받아갈 수 있습니다.\n        - 토벌에 참여한 플레이어 중 랜덤한 1명은 전체 운영금액의 5%에 해당하는 NCG를 보상으로 받습니다.\n        - 토벌에 참여한 플레이어들은 공헌도에 따라 운영 금액의 15% 에 해당하는 NCG를 나눠가집니다.\n    - 어드벤쳐 보스 오픈 타이밍은 플레이어의 운영참여에 의해 결정되는 탈중앙적 시스템이며, 오픈후 4시간 내에 보스를 물리쳐야 합니다. 한번 시즌이 종료되면 10800 블록 이후에 다시 오픈 가능합니다.\n- 어드벤쳐 보스 시스템에 대한 자세한 사항은 아래의 글에서 확인 가능합니다.\n    - https://medium.com/nine-chronicles/9cm-introducing-adventure-boss-eda4712cd2e2\n\n<b> 그리모어 장비 및 그리모어 소환 시스템 추가</b>\n\n- 에메랄드 더스트를 사용하여 소환이 가능한 그리모어 장비가 추가되었습니다.\n    - 소환에서 획득한 장비들은 기본적으로 거래 불가 속성을 갖습니다.\n    - 이번에 추가된 그리모어 장비는 3개의 스킬타입과 4개의 희귀도, 3개의 서브스탯 등으로 구성된 총 36종의 장비가 추가되었습니다.\n- 그리모어 장비는 새로 추가된 그리모어 장비 슬롯에 장착 가능합니다.\n- 에메랄드 더스트는 어드벤쳐 보스 시스템의 운영보상 및 토벌보상으로 획득 가능합니다.\n\n<b> 게임 개선</b>\n\n- 장비 제작 밸런스 변경\n    - 에픽, 유니크,레전드리, 신성등급 장비의 제작 경험이 더욱 좋게 변화했습니다.\n        - 프리미엄 레시피의 제작비용이 많이 가벼워졌습니다.\n            - 제작에 필요한 재료량과 제작시 발생하는 대기 block 이 많이 감소했습니다.\n        - 장비에 스킬이 붙을 확률이 많이 증가했습니다.\n        - 레시피 해금에 필요한 크리스탈이 대폭 감소했습니다.\n    - 노멀, 레어, 에픽, 유니크 등급의 장비 강화에 필요한 NCG가 50% 감소했습니다.\n- 스테이지 밸런스 변경\n    - 6,7,8 월드 몬스터들의 스탯이 많이 감소했습니다.\n- 월드보스 순위 정산 방식 변경\n    - 순위 방식 처리의 일관된 경험을 위해 동점자를 하위로 처리하는 아레나 방식으로 월드보스 순위 처리방식이 변경되었습니다.\n    - 현재 S 등급의 동점자가 다수 발생해 순위에 변별력이 부족한 부분은 이번 분기에 커뮤니티와 함께 수정해 나갈 예정입니다.\n- 콜렉션 11종 추가\n    - 신규 추가된 에메랄드 더스트와 6월 시즌패스 칭호 관련 콜렉션이 추가되었습니다."
        },
        {
            "Header": "v200190",
            "Date": "01.07.2024",
            "Contents": "<b>게임 개선</b>\n\n- libplanet 업데이트를 통하여 블록 생성시간이 안정화될 예정입니다.\n- 음식 사용 UX 개선\n    - 인벤토리에서 같은 ID를 가진 음식은 개별로 표시하지 않고, 수량을 표시하여 좀 더 쉽게 사용 및 확인이 가능하도록 개선했습니다.\n    - PC버전의 샵에서 같은 ID의 음식을 한 번에 여러 개 판매 등록할 수 있도록 UX를 개선하였습니다."
        },
        {
            "Header": "v200180",
            "Date": "07.06.2024",
            "Contents": "<b>루비 소환 업데이트</b>\n\n- 루비 더스트를 사용한 루비 아우라, 루비 룬 소환이 추가되었습니다.\n- 기존 골든 더스트 룬 소환과 비슷하나, 룬의 소환 확률이 다릅니다. 갖고 싶었던 룬의 확률이 높아졌는지 확인하세요!\n- 소환 구성 및 확률 등의 자세한 정보는 워크샵 - 소환에서 확인 가능합니다.\n\n<b>신규 아우라 3종 & 룬 2종 추가</b>\n\n- 신성등급을 포함한 이미르 아우라가 추가되었습니다.\n    - 이미르 아우라는 유니크, 레전드리, 신성 3가지 등급으로 획득 가능합니다.\n    - 이미르 아우라는 워크샵 - 소환 메뉴의 골든아우라와 루비아우라 소환에서 획득 가능합니다.\n- 신성 등급 오딘 룬 2종이 추가되었습니다.\n    - 해당 룬을 포함하여 이후 나올 신성등급 룬 조각은 untradable 속성을 가질 예정입니다.\n    - 해당 룬들은 워크샵 - 소환 메뉴의 골든 룬 과 루비 룬 소환에서 획득 가능합니다.\n\n<b>6월 이벤트</b>\n\n- 정찰보상의 보상품목에 골든더스트와 AP포션이 추가됩니다.\n- 장비 신규 제작시 필요한 대기 블록이 30% 감소됩니다.\n- 250 LV이상의 플레이어들에게 골든더스트를 지급합니다.\n\n<b>루비 가디언 패스 업데이트</b>\n\n- 루비 가디언 칭호를 획득할 수 있는 루비 가디언 패스가 출시되었습니다.\n- 루비 가디언 칭호는 HP 63114, SPD 20872 스탯을 부여하는 뛰어난 성능의 칭호입니다.\n\n<b>게임 개선</b>\n\n- 일부 컬렉션이 보상 상향 되었습니다.\n- 일부 컬렉션이 추가 되었습니다.\n- 워크샵 - 소환 - 일반 섹션의 노멀 아우라 소환에 레어, 에픽, 유니크등급의 아우라들이 추가되었습니다.\n- 게임 시작화면에서 가지고 있는 QR형태의 key를 import 할 수 있는 기능이 추가되었습니다.\n\n<b>버그 수정</b>\n\n- 월드 보스 진행 후 애니메이션 재생속도가 느리게 변경되던 버그가 수정되었습니다.\n- 오딘 체인의 일부 유저에게 8월드 퀘스트 표시 안 되던 버그가 수정되었습니다."
        }
    ]
}