{
    "NoticeData": [
        {
            "Header": "v200260",
            "Date": "20.12.2024",
            "Contents": "<b>合成システムの追加</b>\n\n- <b>新機能</b>: 新しい合成システムにより、複数の低レアリティ装備を組み合わせて高レアリティ装備を制作することができます。\n- <b>対象装備</b>: <b>オーラ</b>および<b>グリモア</b>装備。\n- <b>仕組み</b>:\n    - 複数の低レアリティアイテムを材料として選択します。\n    - 合成を試みて高レアリティのアイテムを制作します。\n    - <b>成功すると</b>、1ランク上のレアリティのアイテムを取得します。<b>失敗すると</b>、使用された同じレアリティのアイテムを取得します。\n詳細な手順や情報については、[NCIP-23](https://github.com/planetarium/NCIPs/blob/ncip-23/NCIP/ncip-23.md)をご参照ください。\n\n<b>神聖等級のオーラ3種類追加</b>\n\n- <b>イージス</b>、<b>バラージ</b>、<b>ビースト</b>の神聖等級オーラが追加されました。\n- <b>ゴールデンダスト召喚</b>および<b>ルビーダスト召喚</b>で獲得可能です。\n\n<b>ラグナロクコラボイベントダンジョン追加</b>\n\n- <b>イベント期間</b>: 2024年12月20日午前5時(UTC) ～ 2025年1月10日午前5時(UTC)\n- <b>特別イベントフード</b>: ワールド7～8で見つかるアイテムに匹敵するブーストを提供。\n- <b>豊富な経験値</b>: 各ステージで<b>11 EXP</b>を獲得可能。\n- <b>豪華な報酬</b>: ゴールデンダスト、ハンマー、砂時計、限定の制作素材を入手できます。\n\n<b>モバイルマイレージ統合</b>\n\n- オーディン、ヘイムダル、トールプラネットのマイレージが統合されました。\n- モバイルショップでのアイテム購入時に統合マイレージがすべてのプラネットで貯まります。\n- 統合マイレージはトールを除くすべてのプラネットで利用可能です。\n\n<b>マイレージショップ新商品追加</b>\n\n- マイレージショップに<b>コスチューム1種</b>および<b>称号1種</b>を追加。\n- <b>ゴールデントールルーン</b>および<b>ゴールデンミート</b>アイテムを追加。\n\n<b>ゲーム改善</b>\n\n- <b>ルーン装備の問題修正</b>: 所有していないルーンが誤って装着される問題を修正し、正常にルーンを装着できるようにしました。"
        },
        {
            "Header": "v200250",
            "Date": "28.11.2024",
            "Contents": "<b>カスタム装備の調整</b>\n\n- <b>ヒット数に基づくダメージ軽減のカスタム装備におけるMAX値の導入</b>\n    - ダメージ軽減は最大30%に制限されます。\n        - この制限はカスタム装備のみに適用されます。カスタム装備とゴールデンリーフルーンを併用する場合、ダメージ軽減は最大81%まで機能します。\n    - その他の潜在的な問題を解決するため、追加の調整が進行中です。近日中に全体的な最小値および最大値が導入される予定で、このプロセスはコミュニティとの協議を通じて進められます。\n        - 次のバージョンである200260のリリースでは、装備が元々意図されていた通りに動作するかどうかを開発チームとともに評価中です。リリースが完了次第、調整および変更に関する詳細な説明を提供します。\n- <b>装備アップグレード時のスキルおよびステータス成長効率の調整</b>\n    - ノーマルからユニーク、レジェンダリーグレードまでの成長効率が更新されました。\n        - アップグレード効率の調整は、影響を最小限に抑えるために2024年11月25日にメインネットに事前適用されました。このテストに基づいて追加の調整が行われた場合は、更新される予定です。\n\n---\n\n<b>ナインクロニクルM 1周年イベント</b>\n\n- <b>無料コスチュームイベント</b>\n    - 1周年を記念して無料のコスチュームを配布します。\n- <b>パトロール報酬イベント</b>\n    - 1周年を記念してパトロール報酬が強化されます。\n- <b>コンテンツ報酬2倍イベント</b>\n    - 1周年期間中、さまざまなコンテンツで2倍以上の報酬を獲得できます。\n- <b>1周年記念イベントダンジョン</b>\n    - ワールド1～8のボスとモンスターが登場する特別なダンジョン。\n    - 新しいイベント素材、APポーション、砂時計、ハンマー、ゴールデンダスト、ルビーダスト、エメラルドダストなどの貴重な報酬を獲得できます。\n    - 通常のイベントダンジョンより高いバランスで設計されており、プレイヤーの進行状況に応じてより多くの報酬を得ることができます。\n    - イベント素材を集めて、<b>オーラ&グリモア1周年記念装備</b>を制作できます。\n- <b>1周年記念シーズンイベントチェーン - トール</b>\n    - 3か月間限定で実施されるイベントチェーン。\n    - 通常より5倍速い成長速度を体験できます。\n    - アリーナルールの改善やギルドプレイのテストなどを目標に含みます。\n    - トールに関する詳細は、今週中にMediumで案内される予定です。\n\n---\n\n<b>召喚システムの改善</b>\n\n- <b>UIの強化</b>\n    - 召喚結果に焦点を当てたUIレイアウトと演出を更新。\n- <b>110回召喚機能の追加</b>\n    - 一度に110個のアイテムを召喚できる機能が追加されました。\n- <b>エメラルドダストを使ったルーン召喚</b>\n    - エメラルドダストを使用してルーンを召喚できるオプションが追加されました。\n- <b>新しい神聖等級のルーン4種の追加</b>\n    - ステージまたはワールドボスで使用可能な<b>ロキ吸血ルーン</b>2種。\n    - ステージまたはワールドボスで使用可能な<b>トール一撃ルーン</b>2種。\n\n---\n\n<b>新しいシーズンパスの追加</b>\n\n- <b>勇気パス</b>\n    - 既存のシーズンパスが名前変更され、機能はそのままです。\n- <b>アドベンチャーボスパス</b>\n    - 毎月リセット。\n    - アドベンチャーボスやモンスターコレクションから追加のルーンの欠片を報酬として獲得できるよう設計されています。\n- <b>ワールドクリアパス</b>\n    - アカウントごとに1回のみ報酬を獲得可能。\n    - 毎月リセットされません。\n    - ワールド1～8の各10ステージをクリアするたびに報酬が付与されます。\n    - 基本報酬だけでもゴールデンダストを利用して、より多くの召喚やコンテンツ利用が可能となるよう設計されています。\n\n---\n\n<b>モバイルマイレージショップオープン</b>\n\n- アイテム購入で1ドルごとに8ポイント獲得。\n- マイレージ専用アイテム11種購入可能。\n\n<b>ゲーム改善</b>\n\n- コレクションフィルターに<b>スキルなし</b>条件を追加。\n- モンスターコレクションがマイグレート可能な状態で金額変更ができなかった問題を改善。"
        },
        {
            "Header": "v200240",
            "Date": "29.10.2024",
            "Contents": "<b>ワールドボス報酬の改善</b>\n\n- ワールドボスシーズン終了後のランキングに基づく報酬に、ゴールデンダストとAPポーションが追加されました。\n    - 1位から100位のプレイヤーは、既存のルーンの欠片およびクリスタルに加えて、順位グループに応じてゴールデンダストとAPポーションを獲得できます。\n    - 詳細な数量はゲーム内のワールドボス - 報酬タブで確認できます。\n- ワールドボス「フェンリル」と「ジェルミニル」の報酬ルーンが新たに交換されます。\n    - 既存のルーンは召喚 - ルーン召喚を通じて新たに入手可能で、PCバージョンのショップで取引可能です。\n    - 新しいルーンは、レジェンダリーのスキルルーンとユニーク、エピックのステータスルーンで構成されています。\n    - 将来的にはシーズン制で報酬ルーンを交換し、コンテンツの価値を維持することをコミュニティと共に取り組んでいきたいと考えています。\n\n<b>ワールドボスルーンの交換と初回クリア報酬の強化</b>\n\n- アドベンチャーボスの報酬ルーン3種類が交換されました。\n    - 以前のCRI、HIT、SPDルーンがHP、ATK、DEFルーンに変更されました。\n    - HPルーンは運営報酬として、ATKとDEFルーンはバトル報酬として取得できます。\n    - 既存のルーンの欠片はPCバージョンのショップで取引可能です。\n    - 今後もシーズン制でルーンを交換し、コンテンツの価値をコミュニティと一緒に維持していく予定です。\n- アドベンチャーボスの初回クリア報酬強化\n    - 各階層の報酬がHITおよびSPDルーンからATKおよびDEFルーンに変更されました。\n    - 各階層でのハンマーの報酬数が50〜100％増加しました。\n\n<b>モンスターコレクションに新しいルーンを追加（トール - ゴールデンシードルーン）</b>\n\n- 新しい報酬として「トール - ゴールデンシードルーン」がモンスターコレクションに追加されました。\n    - ステーキング額が5,000以上のプレイヤーが利用可能です。\n    - この神聖グレードのステータスルーンは、NCGステーキングを行うプレイヤーにとって非常に有用です。\n- マイグレーションガイダンスの強化\n    - 新しい報酬が追加され、モンスターコレクションのマイグレーション後に新しいルーンの欠片を取得できます。\n    - 以前はマイグレーションの案内が不十分であったため、今回の案内を大幅に強化しました。\n    - マイグレーションが可能な場合、ゲーム内のステーキングメニューで案内ポップアップが表示されます。\n        - マイグレーション後、最新の報酬テーブルに基づいて報酬が提供されます。\n        - マイグレーションを行うと、報酬受取の間隔および契約変更の計算開始点がリセットされることに注意してください。\n\n<b>既存ペットのバランス調整および8種類のバリエーションペットの追加</b>\n\n- ペットのバランス調整\n    - 既存の4種類のペット（ブラックキャット、レッドドングリ、ヴァルキリー、リルフェンリル）の性能が向上しました。\n    - ペットの種類とレベルに応じて20〜80％の性能向上が見られます。\n\n- 8種類の新ペットの追加\n    - 既存のペットに似た外見を持つ8種類の新ペットが追加されました。\n    - 制作スロットが4から8にアップグレードされたため、さまざまなペットと一緒に楽しい制作を楽しんでください。\n    - 新しいペットの追加により、ペットを使用する制作UIも更新されました。\n    - 新しいペットは既存のペットと同じ魂の石で解放および強化が可能です。\n\n<b>コレクションバランス調整および新規追加</b>\n\n- コレクションシステムの価値を高めるために、0強化装備、召喚物、新しい食べ物などの低エントリーバリアの新しいコレクションを追加し、既存のコレクションの報酬を強化しました。\n- 73種類の新しいコレクションを追加\n    - 1〜7ワールドの0強化装備（スキルなし）の35種類のコレクションが追加されました。\n    - グリモア装備の36種類のコレクションが追加されました。\n    - ゴールデンステーキの食べ物に関する2種類のコレクションが追加されました。\n- 44種類の既存コレクションのバランス調整\n    - 1〜7ワールドの0強化装備（スキルあり）の35種類のコレクション報酬が大幅に増加しました。\n    - APポーション、砂時計、シルバーダストに関する9種類のコレクション報酬が大幅に増加しました。\n- コレクションの並び順の変更\n    - 完了したコレクションを最下段に配置し、進行中のコレクションを簡単にチェックできるようにしました。\n    - 新しいコレクションを上段に配置し、新規のチェックがしやすくなるようにしました。\n\n<b>11月シーズンパス</b>\n\n- 11月のコレクションリニューアルを記念して、「コレクションマスターパス」が開始されます。\n    - このシーズンパスを通じて「コレクションマスター」の称号を取得できます。\n\n<b>11月イベント</b>\n\n- 11月1ヶ月間、パトロール報酬に多様な報酬を追加し、楽しい冒険をサポートします。\n\n<b>ゲームの改善</b>\n\n- モバイルバージョンでバックグラウンドアプリの音声が停止する現象を修正しました。"
        }
    ]
}