{
  "NoticeData": [
    {
      "Header": "v200380",
      "Date": "25.11.2025",
      "Contents": "## <b>Infinite Tower Open</b>\n\n- <b>The Infinite Tower is a feature designed to offer a wide range of experiences by introducing various conditions and challenges. This initial release is just the first step, and we plan to continue improving it in many ways. We truly appreciate any suggestions you may have, so please feel free to share them with us.</b>\n\n- A challenge-based content that <b>resets once every month</b>.\n- Contains <b>exclusive rewards</b> obtainable only within the Tower.\n    - In this season, clearing <b>Floor 51</b> grants a <b>Mythic-grade costume</b>.\n- Each floor requires specific <b>entry conditions</b> and applies <b>unique buffs</b>, which players must overcome to win the battle.\n- Tickets recharge <b>every 12 hours</b>.\n    - In the Previewnet version, players can attempt more runs thanks to Sapphire Dust rewards from patrol.\n- The Tower initially launches with <b>up to 100 floors</b>, and if enough players reach the final floor in a season, <b>additional floors</b> will be unlocked in the next season.\n\n## <b>2nd Anniversary Event Open</b>\n\n- <b>2nd Anniversary Event Dungeon</b> is now available.\n    - Obtain 100% of all rewards including <b>AP Potions, Dust, Hammers</b>, and more.\n    - Anniversary <b>Grimoire and Aura</b> can be crafted using event materials.\n- Obtain the <b>2nd Anniversary Mythic-grade Costume and Title</b>.\n    - These items receive <b>additional buffs only during the event period</b>, and will return to their original stats afterward.\n    - They <b>cannot be used as Synthesis materials</b>, nor can they be obtained through Synthesis results.\n- <b>Two free Rune Slots unlocked</b>\n    - One Skill Rune Slot and one Stat Rune Slot are added for free.\n    - We hope this allows for more diverse builds and enjoyable adventures.\n\n## <b>New Costumes Added</b>\n\n- Two new costumes for the <b>2025 Autumn Championship Winners</b> have been added.\n    - The <b>2025 Summer Championship Winner</b> costumes are no longer obtainable through Summon or Fusion.\n    - The Autumn Champion costumes will only be obtainable <b>until the Winter Champion costumes are released</b>.\n- Two new costumes: <b>Avatar of Infinity</b> and <b>Avatar of Defense</b>\n    - The <b>Avatar of Infinity</b> costume can be obtained <b>exclusively from the Infinite Tower</b>.\n    - The <b>Avatar of Defense</b> costume can be obtained through <b>Costume Summon</b>.\n\n## The seasonal planet - Thor re-opened\n\n- The upcoming seasonal planet will run from <b>November 25, 2025 to Thursday, January 29, 2026</b>.\n- More details will be shared via our Medium post after the launch tomorrow.\n\n## Portal Shop Open\n\n- A <b>market feature</b> will be added to the <b>Play section</b> of the Nine Chronicles portal site.\n- Through this page, <b>all packages that were previously only purchasable on mobile will also be available on PC</b>.\n- To ensure service stability and prevent mission abuse, <b>the portal shop will only be available to users at level 300 or above</b>.\n\n## Game Improvement\n\n- <b>4 new Mythic Costumes</b>\n    - Added 2 costumes from the <b>2025 Autumn Championship Winner series</b>\n        - The 2 costumes from the <b>2025 Summer Championship Winner series</b> can no longer be obtained via Costume Summon or Combination.\n    - Added <b>1 new Infinite Tower reward–exclusive costume</b>\n    - Added <b>1 new costume exclusive to Costume Summon</b>\n- <b>20 new Collections</b>\n    - <b>9 new equipment-related Collections</b> for the 2nd anniversary\n    - <b>10 new material-related Collections</b>\n    - <b>1 new Season Pass Collection</b>"
    },
    {
      "Header": "v200370",
      "Date": "23.10.2025",
      "Contents": "<b>Custom Equipment Balance Adjustments</b>\n\n- <b>Crafting Cost Adjustments</b>\n    - Required material quantities and block requirements per tier have been reduced by <b>2–4x</b> compared to before.\n- <b>Equipment CP Balance Adjustments</b>\n    - The base balance of Divine-grade equipment has been adjusted to match the overall balance level of Divine–Mythic-grade equipment,\n        \n        resulting in a <b>4–18x increase</b> depending on the tier.\n\n<b>World Boss Balance Adjustments</b>\n\n- Increased stats for the <b>final WAVE boss</b>.\n- <b>Contribution Rewards Increased</b>\n    - Crystals: <b>2x</b> the previous amount\n    - Golden Dust: <b>4x</b> the previous amount\n\n<b>Rune Balance Adjustments</b>\n\n- <b>Mythic-grade Rune Enhancement</b>\n    \n    \n\n<b>Mobile Shop Double Mileage Event</b>\n\n- Starting after the maintenance on <b>October 23</b>, mileage earned from purchases in the <b>Mobile Shop</b> will be <b>doubled</b>.\n    - For <b>Season Pass</b>, the double mileage will apply beginning with the <b>November season</b>.\n\n<b>Mythic-Grade Titles Update</b>\n\n- New <b>Mythic-grade titles</b> have been added and are available for purchase in the <b>Mobile Shop Mileage Store</b>.\n\n<b>New Collections Added</b>\n\n- Collections related to the newly updated items and existing <b>Mythic-grade equipment</b> have been added.\n\n<b>Bug Fix</b>\n- Fixed an issue where banners were not loading properly and appeared as white screens."
    },
    {
      "Header": "v200360",
      "Date": "23.09.2025",
      "Contents": "# <b>Event Dungeon – Ruby Dust Vault</b>\n\n- A special 20-floor event dungeon will run for four weeks.\n- You can earn a variety of hammers and dust (over 3,000 rubydusts in total).\n- In this event dungeon, <b>every play will 100% drop both Hourglasses and Ruby Dust</b>.\n\n# <b>Nine Chronicles Universe</b>\n\n- The Nine Chronicles IP will now officially serve as a hub connecting various types of content.\n    - The primary goal of the Nine Chronicles Universe projects is to <b>increase playtime for Nine Chronicles players</b>.\n    - It will also serve as a gateway to introduce and connect Nine Chronicles and NCG through various external channels.\n    - The first official project, <b>Petpop</b>, will soon launch a new season where players can earn NCG as rewards.\n    - For more detailed guidance on NCU, please refer to the link below.\n\n# <b>Game Improvements</b>\n\n- <b>Mythic-Grade Item Synthesis</b>\n    - 1:1 exchange between Mythic-grade items is now supported.\n    - *Note: This ratio is temporary and will later be adjusted to a standard 2:1 exchange.*\n- <b>Guaranteed Results for Multiple Summons</b>\n    - 10x and 110x summons now come with a guaranteed results system, offering different grades and quantities depending on summon currency and type.\n    - *The guaranteed rewards may change depending on event operations.*\n- <b>Dormant Account Deletion and Recovery Flow</b>\n    - Starting from April 2025, account data of users who have not logged in since before that time will be deleted.\n- The contents of some package products have been updated with adjusted quantities."
    }
  ]
}