{
    "NoticeData": [
        {
            "Header": "v200320",
            "Date": "28.5.2025",
            "Contents": "<b>合成バランス調整</b>\n\n- 合成システムの<b>必要素材量と成功率</b>を見直し、上位グレードのアイテムをより確実に獲得できるようにしました。神話級アイテムも合成で入手可能です。\n- <b>新グリモア追加</b>\n    - 神話級グリモア 9 種\n        - 召喚および合成システムで入手可能\n- <b>新コスチューム追加</b>\n    - 神話級コスチューム 1 種\n\n<b>ワールドボス バランス調整</b>\n\n- 新装備によってプレイヤーのステータスが向上したため、<b>ワールドボスのステータスも強化</b>されました。\n\n<b>ステータス減少スキルの上限適用</b>\n\n- ATK 減少（アイギスオーラ） - <b>最大 85 %</b>\n- SPD 減少（フェンリル SPD ダウン ルーン） - <b>最大 20 %</b>\n- 各スキル ID ごとに上限を適用した後、最終的に加算されます。"
        },
        {
            "Header": "v200310",
            "Date": "24.4.2025",
            "Contents": "<b>ワールド9アップデート – パート1</b>\n- ワールド9「ヴァナヘイム」のステージ401～430が追加されました。\n    - ステージ401～405では、<b>ノーマル神話グレード装備</b>のクラフトレシピを獲得できます。\n    - ステージ415～427では、<b>火属性および水属性の神話グレード装備</b>のクラフトレシピを獲得できます。\n    - 神話グレード装備のクラフトには以下の特徴があります：\n        - <b>ゴールデンダスト</b>がクラフト素材として必要になります。\n        - 一部の素材はクリスタルで代用できず、ステージをクリアして直接獲得する必要があります。\n    - <b>ノーマル神話装備</b>は、既存プレイヤーがワールド9にスムーズに移行できるよう、装備レベル制限が<b>350</b>に設定されています。\n- ワールド9の残りのステージと最終装備は、次回のアップデートで実装予定です。\n- ワールド9のストーリーを伝えるステージダイアログも、次回のアップデートで追加されます。\n\n<b>神話グレードアウラ 4種追加</b>\n- 以下の神話グレードアウラ4種がアウラ召喚に追加されました：\n    \n    <b>ユミル（YMIR）、ビースト（BEAST）、イージス（AEGIS）、バラージ（BARRAGE）</b>\n    \n    - 神話グレードの追加に伴い、召喚確率が調整されました。\n\n<b>神話グレードコスチューム1種 & 神聖グレードコスチューム2種追加</b>\n- 神話グレード「シーラン（Sea Ran）」コスチュームおよび<b>神聖グレードコスチューム2種</b>がコスチューム召喚に追加されました。\n    - 神話グレードの追加により、召喚確率が調整されました。\n    - また、神聖グレードのコスチュームにはステータス強化が行われました。\n\n<b>ルーン強化コストの調整</b>\n- 一部のルーン強化にかかる負担を軽減するため、頻繁に発生していたNCG要求が<b>50レベル単位</b>に圧縮され、代わりに<b>ルーンの欠片の必要量</b>が増加しました。\n    - 調整対象のルーンは以下の通りです：\n        \n        <b>ゴールデンリーフルーン、フェンリルHPルーン、フェンリルATKルーン、フェンリル出血ルーン、セーフリムニル命中ルーン、防御ルーン、スキルルーン、スタンルーン（アドベンチャー）、スタンルーン（アリーナ）、吸血ルーン（アドベンチャー）、吸血ルーン（ワールドボス）、スタミナルーン（アドベンチャー）、スタミナルーン（アリーナ）、クイックルーン（アリーナ）、クイックルーン（ワールドボス）</b>\n\n<b>一部スキルのバランス調整</b>\n- 一部の<b>レジェンド防具</b>および<b>ワールドボスルーン</b>に付与された<b>Thorns（反射）スキル</b>の最大ダメージが調整されました。\n    - これらの装備およびルーンによるダメージは<b>1回あたり最大20万ダメージ</b>に制限されます。\n\n<b>リーダーボード機能の再開</b>\n- クライアントのリーダーボードにおいて、<b>アビリティ</b> と <b>ワールド</b> の2つのカテゴリの機能が再開されました。"
        },
        {
            "Header": "v200290",
            "Date": "11.3.2025",
            "Contents":"<b>ワールドボスの改善</b>\n\n- <b>シーズン報酬の分配方式の変更</b>\n    - 従来のランキング基準の報酬支給方式から、プレイヤーの貢献度に応じて総報酬量を分配する方式に変更されます。\n- <b>報酬の支給方式の改善</b>\n    - シーズン終了後、一括で報酬を配布するのではなく、プレイヤーが個別に<b>クレーム (claim)</b> できるようになります。\n        - <b>クレーム可能期間:</b> シーズン終了後のオフシーズン（2週間）の間に報酬をクレームできます。\n        - <b>クレームの場所:</b> これまでのシーズン報酬の受け取り場所で確認可能です。\n            - シーズン期間中は、総報酬量と自分の貢献度が表示されます。\n            - オフシーズン期間中は、自分の貢献度に基づいたクレーム可能な報酬量が表示されます。\n- <b>チケット購入価格の固定</b>\n    - ワールドボスの報酬システムがランキング基準から貢献度基準へと変更されたため、チケット購入価格を<b>1NCG</b> に固定します。（最大購入数まで同じ価格が適用されます。）\n- <b>ワールドボスのHP調整</b>\n    - <b>すべてのWaveワールドボス</b>のHPが増加します。\n    - <b>ワールドボスのグローバルHP</b>が増加します。\n\n<b>アリーナの改善</b>\n\n- <b>チケット:</b>\n    - チケットの基本購入数が <b>4枚 → 1枚</b> に変更されます。\n    - チケット購入時に、今シーズンの累計購入数が表示されるようになります。\n- <b>対戦リスト:</b>\n    - 参加者が1,000人以上の場合、<b>ランキング1,000位以下のプレイヤー</b>を対戦リストの対象とするように変更されます。\n\n<b>ゲームの改善</b>\n\n- グラインディング時の<b>自動素材登録機能</b>を追加\n- ゲームの実行速度を向上させるため、<b>リーダーボードのランキング表示</b>および<b>カスタムクラフトの装備製作回数表示</b>を一時停止\n\n<b>バグ修正</b>\n\n- 装備中のアイテムを取り外す際に、アクションの実行に問題が発生するバグを修正しました。"
        }
    ]
}