{
    "NoticeData": [
        {
            "Header": "v200150",
            "Date": "28.02.2024",
            "Contents": "<b>コレクションシステムアップデート</b>\n\n- プレイヤーが装備、食料、衣装、称号、材料を集めてStatを獲得できるコレクションシステムが追加されました。\n- このシステムを通じて得られるStatには、既存の+Statと、今回初めて追加される%Statの2種類があります。\n    - %Statは、全ての+Statを合算した後に、既存のスキルバフと組み合わせて百分率で計算されます。\n    - CDMGはクリティカルダメージの略で、クリティカルヒット時に追加で与えられるダメージを増加させるStatです。\n\n<b>モンスターコレクションのゲーム内での開始、変更、報酬獲得機能追加</b>\n\n- モンスターコレクションの開始、数量変更、報酬受取の機能が、以前はPC版ランチャーを通じてのみ可能でしたが、ゲーム内で利用できるようになりました。\n- その結果、PC版を使用しないユーザーもモンスターコレクションを通じて様々な報酬を受け取ることができます。\n\n<b>モンスターコレクションにルビーダスト報酬追加</b>\n\n- コレクションで使用されるルビーダストが、モンスターコレクションの報酬として追加されました。\n- 今後、この素材アイテムの様々な用途を提供する予定です。\n\n<b>SPD関連戦闘処理変更</b>\n\n- プレイヤーが所有するStatの表示が、小数点を使用しないように変更されました。\n- アリーナ、ワールドボス、ステージでのスキル使用後の速度処理が、以前は攻撃と同様に扱われていましたが、変更されました。現在は、スキルを使用した場合、SPD値が0.6ではなく0.9に乗算して再計算されます。これらの変更で、スキルを使用直後のターンを取る確率が大幅に高まりました。\n- この変更は、スキル使用のコストを減らし、スキル装備の価値を高め、今後の戦闘戦略の多様性をスキル使用で強調することを目的としています。\n\n<b>バグ修正</b>\n\n- ワールドボスシーズン開始時にメインロビーでアナウンス画像が表示されない問題を修正しました。\n- アリーナでアバターのレベル表示問題を修正しました。"
        },
        {
            "Header": "v200140",
            "Date": "19.02.2024",
            "Contents": "<b>Libplanet アップデート</b>\n\n- 活動を処理するシステムの速度向上。\n- データ構造の最適化。"
        },
        {
            "Header": "v200132",
            "Date": "31.01.2024",
            "Contents": "<b>ギルド戦イベント準備</b>\n\n- ヘイムダルチェーンのアリーナシーズン3中に行われるギルドイベントに関連する機能がアップデートされました。\n\n<b>モバイルショップイベント準備</b>\n\n- モバイルショップで無料商品を購入するイベントに関連する機能がアップデートされました。\n\n<b>バグ修正</b>\n\n- モンスターコレクションのゴールデンダスト、シルバーダスト、ゴールデンミートの取引可能かどうかの設定が誤っていたため、支給されるバグを修正しました。\n- hit数値が一定値以上で高い数値の場合、missの計算が誤っていたバグを修正しました。\n- 各メニューで終了したイベントを案内していたバグを修正しました。"
        },
        {
            "Header": "v200130",
            "Date": "19.12.2023",
            "Contents": "<b>イベントダンジョンオープン</b>\n\n- 2023年12月20日から2024年1月9日まで、豪華なリワードが得られるイベントダンジョンがオープンします！リワードはゴールデンダスト、シルバーダスト、APポーション、砂時計などがあり、プレイするたびに10以上の経験値を獲得することもできます。\n\n<b>クリスタルルンスロット追加</b>\n\n- ステータスルーンとスキルルーンスロットをそれぞれクリスタル5Mと50Mで一つずつ開くことができます。\n\n<b>新DCCペット機能追加</b>\n\n- 製作にソウルストーンを使用するペット機能が追加されました。 現在はPC版でソウルストーンを獲得することができ、近日中にモバイル版でも使用できるようにする予定です。\n\n<b>バグ修正</b>\n\n- アリーナまたはステージで着用した装備が解除されるバグを修正しました。"
        }
    ]
}