{
    "NoticeData": [
        {
            "Header": "v200310",
            "Date": "24.4.2025",
            "Contents": "<b>World 9 Update – Part 1</b>\n- Stages 401–430 of World 9: Vanaheim have been added.\n    - You can obtain crafting recipes for <b>Normal Mythical-grade equipment</b> from stages 401–405.\n    - Recipes for <b>Fire and Water  Mythical-grade equipment</b> can be obtained from stages 415–427.\n    - The crafting system for Mythical-grade equipment now includes the following characteristics:\n        - <b>Golden Dust</b> is required as a material for crafting.\n        - Some materials cannot be substituted with crystals and must be obtained directly through stages.\n    - The <b>Normal Mythical equipment</b> has a lower level requirement of <b>350</b>, to help existing players transition into World 9 more smoothly.\n- The remaining stages of World 9 and the final set of equipment will be released in the next update.\n- Stage dialogues that reveal the story of World 9 will also be available in the next update.\n\n<b>4 New Mythical-grade Auras Added</b>\n- The following four Mythical-grade auras have been added to aura summons: <b>YMIR, BEAST, AEGIS, and BARRAGE</b>.\n    - Summon rates have been adjusted with the addition of these Mythical-grade auras.\n\n<b>1 New Mythical-grade Costume & 2 New Sacred-grade Costumes</b>\n- The <b>Mythical-grade \"Sea Ran\" costume</b> and <b>2 Sacred-grade costumes</b> have been added to costume summons.\n    - Summon rates have been adjusted with the addition of the Mythical-grade costume.\n    - Sacred-grade costumes have received stat buffs following the introduction of the new Mythical grade.\n\n<b>Rune Enhancement Cost Adjustment</b>\n- To reduce the burden of enhancing certain runes, frequent NCG requirements have been compressed into 50-level intervals, and the required number of rune shards has been increased.\n    - The following runes are included in this adjustment:\n        - <b>Golden Leaf Rune, Fenrir HP Rune, Fenrir ATK Rune, Fenrir Bleeding Rune, Saehrimnir HIT Rune, Saehrimnir DEF Rune, Saehrimnir Skill Rune, Stun Rune (Adventure), Stun Rune (Arena), Vampiric Rune (Adventure), Vampiric Rune (World Boss), Stamina Rune (Adventure), Stamina Rune (Arena), Quick Rune (Arena), Quick Rune (World Boss)</b>\n\n<b>Skill Balance Changes</b>\n- The max damage of the <b>Thorns skill</b> attached to some <b>Legend armor</b> and world <b>boss runes</b> has been adjusted.\n    - The damage dealt by these items and runes is now capped at <b>200,000 per hit</b>.\n\n<b>Leaderboard Feature Resumed</b>\n- The leaderboard feature has been resumed for two categories in the client: <b>Ability</b> and <b>World</b>."
        },
        {
            "Header": "v200290",
            "Date": "11.3.2025",
            "Contents":"<b>World Boss Improvements</b>\n\n- <b>Changes to Season Reward Distribution</b>\n    - The reward distribution method will change from a ranking-based system to a system where the total reward pool is distributed based on players' contributions.\n- <b>Improved Reward Distribution System</b>\n    - Instead of distributing rewards in bulk after the season ends, players will now be able to <b>claim</b> their rewards individually.\n        - <b>Claim Period:</b> Rewards can be claimed during the two-week off-season after the season ends.\n        - <b>Claim Location:</b> The rewards can be found in the same location as the previous season rewards.\n            - During the season, the total reward pool and the player's contribution will be displayed.\n            - During the off-season, the reward amount claimable based on the player's contribution will be displayed.\n- <b>Fixed Ticket Purchase Price</b>\n    - Due to the change in the reward system from ranking-based to contribution-based, the ticket purchase price will be fixed at <b>1 NCG</b> (The same price applies up to the maximum purchase limit).\n- <b>World Boss HP Adjustment</b>\n    - HP of all <b>Wave World Bosses</b> will be increased.\n    - The <b>Global HP</b> of the World Boss will be increased.\n\n<b>Arena Improvements</b>\n\n- <b>Tickets:</b>\n    - The default ticket purchase amount will be changed from <b>4</b> to <b>1</b>.\n    - When purchasing tickets, the total number of tickets purchased for the season will be displayed.\n- <b>Opponent List:</b>\n    - If there are more than 1,000 participants, the opponent list will be adjusted to target those ranked below <b>1,000</b>.\n\n<b>Game Improvements</b>\n\n- Added an <b>automatic material registration feature</b> for grinding.\n- To improve game execution speed, the leaderboard ranking display and <b>custom craft equipment production count</b> display will be temporarily paused.\n\n<b>Bug Fixes</b>\n\n- Fixed a bug where an error occurred when removing equipped items."
        },
        {
            "Header": "v200280",
            "Date": "14.2.2025",
            "Contents": "<b>Arena Rule Changes</b>\n\n- <b>Ticket Refill Count</b>:\n    - Each refill (initial and subsequent) grants <b>5 tickets</b>.\n    - There are <b>20 ticket distributions per season</b>, allowing a total of <b>100 basic tickets</b>.\n    - Additional ticket purchases limited to 24 <b>tickets</b> (4 per interval).\n    - <b>Purchase Prices</b>:\n        - <b>Season</b>: Starts at 1, increases by 0.2 per purchase.\n        - <b>Championship</b>: Starts at 2, increases by 0.2 per purchase.\n        - Up to 4 tickets can be purchased at once; unused tickets reset when the interval changes.\n- <b>Service Stability Note</b>:\n    - During the last 10 blocks of each interval, refreshing the opponent list and conducting arena battles using tickets will be unavailable.\n    - Additionally, ticket purchases will be unavailable during the last 40 blocks.\n- <b>Score and Ranking Updates</b>:\n    - Updates occur at the start of each ticket refill interval.\n    - Battle scores and win/loss stats are displayed in the UI and reset at the beginning of the next interval.\n- <b>Opponent List Updates</b>:\n    - At each ticket refill interval, 5 fixed opponents are displayed based on rank groups:\n        \n        \n        | Group | Range (%) | Win Score | Loss Score |\n        | --- | --- | --- | --- |\n        | 1st | Top 0–5% | +22 | -1 |\n        | 2nd | Top 5–20% | +21 | -2 |\n        | 3rd | Top 20–60% | +20 | -3 |\n        | 4th | Top 60–80% | +18 | -4 |\n        | 5th | Top 80–100% | +16 | -5 |\n        - Opponents are chosen randomly from these groups.\n        - If you are targeted and defeated by an opponent during the interval, your rating will decrease by 1.\n        - <b>Opponent refresh:</b>\n            - Up to 7 refreshes per round.\n        - <b>Refresh Cost</b>\n            - First 3 refreshes are free; the following 4 are paid.\n            - The paid refresh cost starts at 0.5 NCG and increases by 0.5 NCG with each use.\n    - Battles cost <b>5 AP per action</b>.\n    - Ingredients previously awarded as Arena rewards are now obtainable from specific stages in each world.\n\n<b>Battle and Score Processing Updates</b>\n\n- <b>Opponent List & Scoring</b>:\n    - Now processed through dedicated external services rather than on-chain contracts.\n- <b>Event Management</b>:\n    - Event organizers (other than Planetarium) can customize rules such as scoring and ranking.\n- <b>On-Chain Records</b>:\n    - The blockchain will log and return battle results processed via external services.\n\n<b>Clan Battle Feature</b>\n\n- <b>Clan Scoring</b>:\n    - Clan scores are calculated by summing the top 10 players’ scores within the clan.\n- <b>Rewards</b>:\n    - Clan rankings determine seasonal rewards.\n- <b>Testing Phase</b>:\n    - Clan data will first be tested on <b>Thor</b>. After testing, clan-related features will be rolled out across all chains.\n\n<b>Game Improvements</b>\n\n<b>Planned Features</b>\n\n- <b>Inventory Sorting in the PC Version Shop</b>:\n    - Items are now grouped by type and sorted by CP (Combat Power).\n- <b>Mobile Version - Planet Access Notification</b>:\n    - If planet data cannot be retrieved, a message will inform users that access is temporarily restricted and to try again later.\n- <b>NCG Refund Button Adjustment in Staking Popup</b>:\n    - The NCG refund claim button, previously available only in the amount change flow, is now directly visible in the main popup.\n\n<b>Bug Fixes</b>\n\n- <b>Resolved an issue where adding a new synthesis material removed previously registered materials.</b>"
        }
    ]
}