{
  "NoticeData": [
    {
      "Header": "v200360",
      "Date": "23.09.2025",
      "Contents": "# <b>Event Dungeon – Ruby Dust Vault</b>\n\n- A special 20-floor event dungeon will run for four weeks.\n- You can earn a variety of hammers and dust (over 3,000 rubydusts in total).\n- In this event dungeon, <b>every play will 100% drop both Hourglasses and Ruby Dust</b>.\n\n# <b>Nine Chronicles Universe</b>\n\n- The Nine Chronicles IP will now officially serve as a hub connecting various types of content.\n    - The primary goal of the Nine Chronicles Universe projects is to <b>increase playtime for Nine Chronicles players</b>.\n    - It will also serve as a gateway to introduce and connect Nine Chronicles and NCG through various external channels.\n    - The first official project, <b>Petpop</b>, will soon launch a new season where players can earn NCG as rewards.\n    - For more detailed guidance on NCU, please refer to the link below.\n\n# <b>Game Improvements</b>\n\n- <b>Mythic-Grade Item Synthesis</b>\n    - 1:1 exchange between Mythic-grade items is now supported.\n    - *Note: This ratio is temporary and will later be adjusted to a standard 2:1 exchange.*\n- <b>Guaranteed Results for Multiple Summons</b>\n    - 10x and 110x summons now come with a guaranteed results system, offering different grades and quantities depending on summon currency and type.\n    - *The guaranteed rewards may change depending on event operations.*\n- <b>Dormant Account Deletion and Recovery Flow</b>\n    - Starting from April 2025, account data of users who have not logged in since before that time will be deleted.\n- The contents of some package products have been updated with adjusted quantities."
    },
    {
      "Header": "v200350",
      "Date": "21.08.2025",
      "Contents": "- <b>Adventure Boss Floors 21–30 Added</b>\n    - First-clear exclusive Yggdrasil stat runes for upper-tier Adventure Boss floors updated.\n        - Four types of Mythic-grade runes have been added, each appearing according to the type of Adventure Boss.\n- <b>Rune Updates</b>\n    - Balance adjustments to existing runes.\n        - Stat balance for almost existing runes has been adjusted between 2x and 20x.\n            - Many lower-grade and stat runes have been significantly boosted.\n        - NCG consumption for enhancing the basic Adventurer’s Rune has been changed to 0.\n    - Four new Mythic-grade runes added.\n        - Four new Mythic-grade runes have been added to Rune Summoning.\n            - To ensure balance stability, Mythic-grade runes have a maximum level cap of 150.\n- <b>Three New Mythic-grade Costumes Added</b>\n    - The companion Dag has been added to the Water-element Ran costume.\n    - Two costumes have been added to commemorate the winners of each quarter’s championship.\n        - Once the winner of the current Heimdall Championship is decided, the costumes will be renamed after the Odin and Heimdall winners.\n        - The concept is to honor the warriors whom Freyja guides to Valhalla for Ragnarok.\n        - This costume can only be obtained through Summon and Fusion until version 200380, when the next Championship winners of the new Odin and Heimdall emerge.\n- Game Improvement\n    - Fixed connection issue on mobile version during node failures."
    },
    {
      "Header": "v200340",
      "Date": "29.07.2025",
      "Contents": "<b>World 9: Second-Half Update</b>\n- <b>Stages 431–450 added</b>\n    - The final stages of the regular World 9 have been released.\n    - <b>10 Mythic-grade gear pieces</b> added: 5 Earth-attribute and 5 Wind-attribute.\n    - <b>20 stage quests</b> (for 431–450) and <b>10 equipment-crafting quests</b> added.\n- <b>World 9 Dialog Added</b>\n    - The final chapter of the main scenario unfolds across <b>Stages 401–450</b>.\n\n<b>Change to Mobile Login Methods</b>\n\n- On first login in the mobile version, you will no longer be able to sign in via <b>Twitter</b> or <b>Discord</b>.\n    - This will be applied to the <b>Apple M</b> build first. <b>Apple K</b> and <b>Android M/K</b> will adopt the change starting with the next update.\n\nImprovements\n\n- <b>Adventure Boss bounty distribution updated</b>\n    - <b>Before:</b> 15% to slayers, 80% to staking users, 5% to a random single player.\n    - <b>Now:</b> 30% to slayers, 65% to staking users, 5% to a random single player.\n    - A Planetarium account will distribute <b>at least 200,000 NCG per chain</b> as bounty—your interest and participation are appreciated.\n- <b>Item-related storage improvements</b>\n    - Improved the blockchain storage model for <b>items, skills, and stats</b>.\n- Adjusted the <b>required CP for sweeps</b> on stages <b>401–430</b>.\n    - The <b>CP needed to perform sweeps</b> on stages 401–430 has been reduced.\n- <b>Mythic-grade costume “Skuld” added</b>\n    - Skuld is now included in <b>Summon</b> and <b>Synthesis</b> targets.\n- <b>27 new Collections</b>\n    - 2 Skuld-related collections.\n    - 10 “no-skill” collections for <b>World 9 Normal, Fire, and Water</b> attribute gear.\n    - 15 Dust/Item collections: <b>5 Ruby Dust</b>, <b>5 Emerald Dust</b>, <b>5 Golden Meat</b>.\n- <b>Stage dialog display order changed</b>\n    - <b>Before:</b> shown after the stage result popup.\n    - <b>Now:</b> shown before the stage result popup.\n- <b>Costume Summon probability info popup order changed</b>\n    - Now sorted in <b>descending order</b> from higher grade to lower grade.\n- <b>Settings</b>\n    - Removed the <b>Redeem Code</b> button."
    }
  ]
}