{
    "NoticeData": [
        {
            "Header": "v200200",
            "Date": "09.07.2024",
            "Contents": "<b>Adventure Boss System Added</b>\n\n- The Adventure Boss System has been added.\n    - Players can become operating users with NCG and receive rewards such as Golden, Ruby, or Emerald Dust, as well as new Critical Rune stones.\n    - Participate in raids using AP Potions and receive rewards like hammers, NCG, dust, and new rune stones.\n        - One random player among the participants will receive 5% of the total operating amount in NCG as a reward.\n        - Participants will share 15% of the operating amount in NCG based on their contribution.\n    - The timing of the Adventure Boss opening is determined by the decentralized participation of players and must be defeated within 4 hours of opening. Once the season ends, it can be reopened after 10,800 blocks.\n- For more details about the Adventure Boss System, please check the following article:\n    - [Introducing Adventure Boss](https://medium.com/nine-chronicles/9cm-introducing-adventure-boss-eda4712cd2e2)\n\n<b>Grimoire Equipment and Summoning System Added</b>\n\n- Grimoire equipment, which can be summoned using Emerald Dust, has been added.\n    - The equipment obtained from summoning is non-tradable by default.\n    - A total of 36 types of equipment have been added, comprising 3 skill types, 4 grade levels, and 3 sub-stats.\n- Grimoire equipment can be equipped in the newly added Grimoire equipment slot.\n- Emerald Dust can be obtained as operational rewards and raid rewards in the Adventure Boss System.\n\n<b>Game Improvements</b>\n\n- Equipment Crafting Balance Changes\n    - The crafting experience for Epic, Unique, Legendary, and Sacred grade equipment has been greatly improved.\n        - The crafting cost for premium recipes has been significantly reduced.\n            - The amount of materials required and the waiting blocks generated during crafting have been greatly decreased.\n        - The chance of attaching skills to equipment has been greatly increased.\n        - The amount of crystals needed to unlock recipes has been drastically reduced.\n    - The NCG required to enhance Normal, Rare, Epic, and Unique grade equipment has been reduced by 50%.\n- Stage Balance Changes\n    - The stats of monsters in Worlds 6, 7, and 8 have been significantly decreased.\n- Change in World Boss Ranking Calculation Method\n    - To ensure a consistent experience in ranking methods, the World Boss ranking calculation method has been changed to an arena-style system where ties are ranked lower.\n    - The current issue of multiple ties at the S grade level, leading to a lack of distinction in rankings, will be addressed in collaboration with the community this quarter.\n- Addition of 11 New Collections\n    - New collections have been added, including the newly introduced Emerald Dust and the June Season Pass title-related collections."
        },
        {
            "Header": "v200190",
            "Date": "01.07.2024",
            "Contents": "<b>Game Improvements</b>\n\n- Block creation time will be stabilized through the libplanet update.\n- Improved food usage UX:\n    - In the inventory, food with the same ID will no longer be displayed individually. Instead, the quantity will be shown to make it easier to use and check.\n    - In the PC version of the shop, the UX has been improved to allow multiple food items with the same ID to be listed for sale at once."
        },
        {
            "Header": "v200180",
            "Date": "07.06.2024",
            "Contents": "<b>Ruby Summon Update</b>\n\n- Ruby Aura and Ruby Rune summon using Ruby Dust has been added.\n- Similar to the existing Golden Dust Rune summon, but the summoning probabilities for runes are different. Check if the probability for the rune you wanted has increased!\n- Detailed information on summon composition and probabilities can be found in Workshop - Summon.\n\n<b>New Auras and Runes Added</b>\n\n- Three new Ymir Auras, including a Sacred grade, have been added. Ymir Auras can be obtained in three grades: Unique, Legendary, and Sacred. Ymir Auras can be obtained through Golden Aura and Ruby Aura summon in Workshop - Summon menu.\n- Two new Sacred grade Odin Runes have been added. These runes, along with future Sacred grade rune shards, will have the untradable attribute. These runes can be obtained through Golden Rune and Ruby Rune summon in Workshop - Summon menu.\n\n<b>June Event</b>\n\n- Golden Dust and AP Potions have been added to the reward items for patrol rewards.\n- The waiting block required for new equipment craft is reduced by 30%.\n- Golden Dust will be distributed to players above level 250.\n\n<b>Ruby Guardian Pass Update</b>\n\n- The Ruby Guardian Pass, which allows you to obtain the Ruby Guardian title, has been released.\n- The Ruby Guardian title grants outstanding stats with HP 63,114 and SPD 20,872.\n\n<b>Game Improvements</b>\n\n- Some collections have had their rewards enhanced.\n- Some new collections have been added.\n- Rare, Epic, and Unique grade auras have been added to the Normal Aura summon section in Workshop - Summon.\n- A feature to import your QR code-shaped key has been added to the game start screen.\n\n<b>Bug Fixes</b>\n\n- Fixed a bug where the animation speed slowed down after the World Boss event.\n- Fixed a bug where some users did not see the 8th World Quest in Odin Chain."
        }
    ]
}