{
    "NoticeData": [
        {
            "Header": "v200160",
            "Date": "27.03.2024",
            "Contents": "<b>New World 8 Added</b>\n\n- New World 8, HELHEIM, has opened!\n    - 50 stages, ranging from 351-400, have been added.\n- New grade, Sacred Class equipment has been added!\n    - Recipes for making a total of 25 types of equipment, including weapons, armor, belts, necklaces, and rings, have been added, with 5 kinds for each type.\n- 6 new types of food have been added!\n    - Recipes for crafting these 6 types of food have been added.\n- Level data up to a maximum of 500 levels has been added.\n\n<b>Collection System Improvements</b>\n\n- Convenience features have been added to the collection system.\n    - A shortcut feature to obtain the materials needed for the collection has been added.\n    - The collection list sorting function has been improved.\n        - It is sorted in the order of immediate completion possible, some conditions met, and no progress made.\n    - A shortcut to the collection menu from the crafting menu has been added.\n    - Stats obtained from the collection can be checked in the stage, arena, and world boss battle preparation screens.\n\n<b>In-Game Monster Collection Improvement</b>\n\n- A presentation for checking items received when collecting monster collection rewards has been added.\n- The main lobby now displays information related to monster collection progress.\n    - It shows the level and the remaining time until reward claim.\n- Migration feature added\n    - When rewards are updated, migration can be conducted to renew the agreement with new rewards.\n\n<b>April Event</b>\n\n- Balance adjustments in celebration of the World 8 update.\n    - The block and required material quantities for crafting equipment in Worlds 1-7 have been changed.\n\n<b>Game Improvements</b>\n\n- The collection list has been expanded, and some reward balances have been adjusted.\n- The SKIP feature for World Bosses now skips the entire battle.\n- A retry button has been added after clearing the last stage of the event dungeon.\n- The maximum amount of AP potion that can be used with the SWEEP feature during stage progression has been increased from 10 to 20.\n- The REPEAT feature during stage progression now allows for the use of 1 bottle of AP potion.\n- The crystal substitute cost for crafting equipment with legendary-grade materials has been reduced by 33%."
        },
        {
            "Header": "v200150",
            "Date": "28.02.2024",
            "Contents": "<b>Collection System Update</b>\n\n- A collection system has been added that allows players to gather equipment, food, costumes, titles, and materials to acquire Stats.\n- The stats obtained through this system include two types: the existing + stats and the % stats, which are being added for the first time.\n    - % stats are calculated in combination with existing skill buffs, applying the percentage after summing all + stats.\n    - CDMG is an abbreviation for Critical Damage, a stat that increases the additional damage dealt on a critical hit.\n\n<b>Monster Collection In-Game Start, Change, and Claim Feature Added</b>\n\n- The functionality to start Monster Collection, change amounts, and claim rewards, which was previously only possible through the PC version launcher, has been made available in-game for players.\n- As a result, users who do not use the PC version can also receive various rewards through the Monster Collection.\n\n<b>Monster Collection Ruby Dust Reward Added</b>\n\n- Ruby Dust, used in the collection, has been added as a reward for the Monster Collection.\n- Plans are in place to provide various uses for this material item in the future.\n\n<b>SPD Related Combat Processing Change</b>\n\n- The display of stats owned by players has been changed to not use decimals.\n- In arenas, world bosses, and stages, the processing of speed after using a skill, which was previously treated the same as attacks, has been changed. Now, when a skill is used, the SPD value is recalculated by multiplying by 0.9 instead of 0.6. Through these changes, the probability of taking another turn after using a skill has significantly increased.\n- This change aims to reduce the cost of using skills, thereby increasing the value of skill equipment and emphasizing the diversity of combat strategy with skill use going forward.\n\n<b>Bugfix</b>\n\n- Fixed an issue where the announcement image did not display in the main lobby at the start of the World Boss season.\n- Fixed an issue where the levels of avatars in the arena were displayed abnormally."
        },
        {
            "Header": "v200140",
            "Date": "19.02.2024",
            "Contents": "<b>Libplanet Update</b>\n\n- Making systems faster at processing activities.\n- Optimization of data structures."
        }
    ]
}